tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
void formatRecordTargetValue(const WaterRecord& record, char* out, std::size_t len) {
    if (!out || len == 0) {
        return;
    }
    if (record.mode == WaterMode::Time) {
        formatSecondsValue(record.targetValue, out, len);
        return;
    }
    formatLiters(record.targetValue, out, len);
}

void formatRecordPresetLabel(const WaterRecord& record, char* out, std::size_t len) {
    if (!out || len == 0) {
        return;
    }
    char target[24]{};
    formatRecordTargetValue(record, target, sizeof(target));
    if (record.selectedPreset < kPresetCount) {
        std::snprintf(out,
                      len,
                      "预设 %u · %s",
                      static_cast<unsigned>(record.selectedPreset) + 1U,
                      target);
    } else {
        std::snprintf(out, len, "未知预设 · %s", target);
    }
}

void formatDurationShort(std::uint32_t seconds, char* out, std::size_t len) {
    if (!out || len == 0) {
        return;
    }
    if (seconds >= 3600UL) {
        std::snprintf(out, len, "%luh %lum", static_cast<unsigned long>(seconds / 3600UL),
                      static_cast<unsigned long>((seconds / 60UL) % 60UL));
    } else if (seconds >= 60UL) {
        std::snprintf(out, len, "%lum %lus", static_cast<unsigned long>(seconds / 60UL),
                      static_cast<unsigned long>(seconds % 60UL));
    } else {
        std::snprintf(out, len, "%lus", static_cast<unsigned long>(seconds));
    }
}

std::uint32_t percentOf(std::uint32_t value, std::uint32_t total) {
    if (total == 0) {
        return 0;
    }
    const std::uint64_t percent = (static_cast<std::uint64_t>(value) * 100ULL) / total;
    return percent > 100ULL ? 100UL : static_cast<std::uint32_t>(percent);
}

void addSaturating(std::uint32_t& target, std::uint32_t value) {
    const std::uint32_t max = UINT32_MAX;
    target = max - target < value ? max : target + value;
}

bool waterTaskActive() {
    if (!g_context.app) {
        return false;
    }
    const WaterState state = g_context.app->snapshot().water.state;
    return state == WaterState::Confirm || state == WaterState::Running || state == WaterState::Paused;
}

void sendBusyJson(const char* context) {
    char json[80]{};
    std::snprintf(json, sizeof(json), "{\"error\":\"busy\",\"context\":\"%s\"}", context ? context : "web");
    Esp32BaseWeb::sendJson(409, json);
}

StablePulseEstimateCache stablePulseCacheKey() {
    StablePulseEstimateCache key{};
    if (g_context.pulseTraces) {
        key.ramTraceCount = g_context.pulseTraces->count();
        if (key.ramTraceCount > 0) {
            const WaterPulseTrace* latest = g_context.pulseTraces->traceAt(key.ramTraceCount - 1);
            if (latest) {
                key.latestRamTraceId = latest->traceId;
                key.latestRamTraceFinished = latest->finished;
            }
        }
    }
    return key;
}

bool stablePulseCacheMatches(const StablePulseEstimateCache& key) {
    return g_stablePulseEstimateCache.ready &&
           g_stablePulseEstimateCache.ramTraceCount == key.ramTraceCount &&
           g_stablePulseEstimateCache.latestRamTraceId == key.latestRamTraceId &&
           g_stablePulseEstimateCache.latestRamTraceFinished == key.latestRamTraceFinished;
}

std::uint32_t recentAverageFlowMlPerMin() {
    if (!g_context.records || !g_context.records->ready()) {
        return 0;
    }
    std::unique_ptr<WaterRecord[]> records(new (std::nothrow) WaterRecord[kDefaultRecordPageSize]{});
    if (!records) {
        return 0;
    }
    const std::size_t read =
        g_context.records->readPage(0, kDefaultRecordPageSize, records.get(), kDefaultRecordPageSize);
    std::uint32_t totalMl = 0;
    std::uint32_t totalDurationSec = 0;
    for (std::size_t i = 0; i < read; ++i) {
        if (records[i].volumeMl == 0 || records[i].durationSec == 0) {
            continue;
        }
        addSaturating(totalMl, records[i].volumeMl);
        addSaturating(totalDurationSec, records[i].durationSec);
    }
    if (totalMl == 0 || totalDurationSec == 0) {
        return 0;
    }
    return static_cast<std::uint32_t>(
        (static_cast<std::uint64_t>(totalMl) * 60ULL + totalDurationSec / 2ULL) / totalDurationSec);
}

std::uint32_t durationMsToDisplaySec(std::uint32_t durationMs) {
    if (durationMs == 0) {
        return 0;
    }
    return static_cast<std::uint32_t>((static_cast<std::uint64_t>(durationMs) + 500ULL) / 1000ULL);
}

std::uint32_t estimateDurationForVolumeTarget(std::uint32_t targetMl, const MeteringParameters& params) {
    return durationMsToDisplaySec(estimateDurationMsForVolumeMl(params, targetMl));
}

void applyTimeEstimateForTarget(AppSnapshot& snapshot,
                                std::uint32_t targetSec,
                                std::uint32_t& volumeMl,
                                std::uint32_t& pulseCount,
                                float& stablePulsePerSec,
                                const char*& reason) {
    volumeMl = 0;
    pulseCount = 0;
    stablePulsePerSec = 0.0f;
    reason = nullptr;
    if (!validMeteringSchemeParameters(snapshot.meteringParams)) {
        reason = "计量参数未就绪";
        return;
    }
    if (targetSec == 0) {
        reason = "目标时间为空";
        return;
    }
    const std::uint64_t durationMs = static_cast<std::uint64_t>(targetSec) * 1000ULL;
    volumeMl = estimateVolumeMlForDurationMs(
        snapshot.meteringParams,
        durationMs > UINT32_MAX ? UINT32_MAX : static_cast<std::uint32_t>(durationMs));
    pulseCount = estimatePulsesForVolumeMl(snapshot.meteringParams, volumeMl);
    stablePulsePerSec =
        static_cast<float>(static_cast<double>(snapshot.meteringParams.stableFlowMlPerMin) *
                           static_cast<double>(snapshot.meteringParams.stablePulsePerLiter) / 60000.0);
    if (pulseCount == 0 || volumeMl == 0) {
        reason = "计量参数未就绪";
        pulseCount = 0;
        volumeMl = 0;
        stablePulsePerSec = 0.0f;
    }
}

void applyTargetDurationEstimate(AppSnapshot& snapshot, bool includeRecentFlow = true) {
    snapshot.targetEstimatedDurationSec = 0;
    snapshot.selectedPresetEstimatedDurationSec = 0;
    snapshot.targetEstimatedVolumeMl = 0;
    snapshot.targetEstimatedPulseCount = 0;
    snapshot.targetStablePulsePerSec = 0.0f;
    snapshot.targetEstimateReason = nullptr;
    snapshot.selectedPresetEstimatedVolumeMl = 0;
    snapshot.selectedPresetEstimatedPulseCount = 0;
    snapshot.selectedPresetStablePulsePerSec = 0.0f;
    snapshot.selectedPresetEstimateReason = nullptr;
    const std::uint32_t flowMlPerMin = includeRecentFlow ? recentAverageFlowMlPerMin() : 0;
    snapshot.recentAverageFlowMlPerMin = flowMlPerMin;
    if (snapshot.water.mode == WaterMode::Volume) {
        snapshot.targetEstimatedDurationSec =
            estimateDurationForVolumeTarget(snapshot.water.targetValue, snapshot.meteringParams);
        if (!validMeteringSchemeParameters(snapshot.meteringParams)) {
            snapshot.targetEstimateReason = "计量参数未就绪";
        }
    } else {
        applyTimeEstimateForTarget(snapshot,
                                   snapshot.water.targetValue,
                                   snapshot.targetEstimatedVolumeMl,
                                   snapshot.targetEstimatedPulseCount,
                                   snapshot.targetStablePulsePerSec,
                                   snapshot.targetEstimateReason);
    }
    if (g_context.config && snapshot.water.selectedPreset < kPresetCount) {
        const PresetConfig& preset = g_context.config->presets[snapshot.water.selectedPreset];
        if (preset.enabled && preset.type == PresetType::Volume) {
            snapshot.selectedPresetEstimatedDurationSec =
                estimateDurationForVolumeTarget(preset.value, snapshot.meteringParams);
            if (!validMeteringSchemeParameters(snapshot.meteringParams)) {
                snapshot.selectedPresetEstimateReason = "计量参数未就绪";
            }
        } else if (preset.enabled && preset.type == PresetType::Time) {
            applyTimeEstimateForTarget(snapshot,
                                       preset.value,
                                       snapshot.selectedPresetEstimatedVolumeMl,
                                       snapshot.selectedPresetEstimatedPulseCount,
                                       snapshot.selectedPresetStablePulsePerSec,
                                       snapshot.selectedPresetEstimateReason);
        }
    }
}

