tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
bool sameWaterRecordIdentity(const WaterRecord& a, const WaterRecord& b) {
    return a.startTime == b.startTime && a.volumeMl == b.volumeMl && a.targetValue == b.targetValue &&
           a.pulseCount == b.pulseCount && a.durationSec == b.durationSec && a.selectedPreset == b.selectedPreset &&
           a.result == b.result;
}

std::uint32_t estimateVolumeMlFromPulses(std::uint32_t pulseCount, const MeteringParameters& params) {
    if (pulseCount == 0 || params.stablePulsePerLiter == 0) {
        return 0;
    }
    if (params.startupPulseCount > 0 && pulseCount <= params.startupPulseCount) {
        return static_cast<std::uint32_t>(
            (static_cast<std::uint64_t>(pulseCount) * params.startupVolumeMl + params.startupPulseCount / 2ULL) /
            params.startupPulseCount);
    }
    const std::uint32_t stablePulses =
        pulseCount > params.startupPulseCount ? pulseCount - params.startupPulseCount : pulseCount;
    const std::uint64_t stableMl =
        (static_cast<std::uint64_t>(stablePulses) * 1000ULL + params.stablePulsePerLiter / 2ULL) /
        params.stablePulsePerLiter;
    const std::uint64_t total = static_cast<std::uint64_t>(params.startupVolumeMl) + stableMl;
    return total > UINT32_MAX ? UINT32_MAX : static_cast<std::uint32_t>(total);
}

bool findRecordCalibration(const WaterRecord& record, WaterRecordCalibration& calibration) {
    return g_context.recordCalibrations && g_context.recordCalibrations->ready() &&
           g_context.recordCalibrations->find(record, calibration);
}

bool meteringParamsForRecordTrend(const WaterRecord& record, MeteringParameters& params) {
    MeteringSchemeRecord scheme{};
    if (ensureMeteringSchemesReady() && g_context.meteringSchemes->findById(record.meteringSchemeId, scheme) &&
        validMeteringSchemeParameters(scheme.params)) {
        params = scheme.params;
        return true;
    }
    return false;
}

std::uint32_t actualMlForTrace(const WaterPulseTrace& trace) {
    if (trace.actualMl > 0) {
        return trace.actualMl;
    }
    WaterRecordCalibration calibration{};
    return findRecordCalibration(trace.record, calibration) ? calibration.actualMl : 0;
}

std::uint32_t measuredPulsePerLiter(const WaterRecord& record, const WaterRecordCalibration& calibration) {
    if (record.pulseCount == 0 || calibration.actualMl == 0) {
        return 0;
    }
    return static_cast<std::uint32_t>(
        (static_cast<std::uint64_t>(record.pulseCount) * 1000ULL + calibration.actualMl / 2ULL) /
        calibration.actualMl);
}

bool copyRamTraceBuckets(const WaterPulseTrace& trace,
                         WaterPulseTraceBucketSample* output,
                         std::size_t outputCapacity) {
    if (!g_context.pulseTraces || !output || outputCapacity < trace.bucketCount) {
        return false;
    }
    for (std::size_t i = 0; i < trace.bucketCount; ++i) {
        const WaterPulseTraceBucketSample* bucket = g_context.pulseTraces->bucketAt(trace, i);
        if (!bucket) {
            return false;
        }
        output[i] = *bucket;
    }
    return true;
}

bool stablePulsePerSecFromTrace(const WaterPulseTrace& trace, float& stablePulsePerSec) {
    stablePulsePerSec = 0.0f;
    if (!trace.finished || trace.resumedAfterPause || trace.bucketCount == 0 || trace.totalPulses == 0 ||
        (trace.flags & kPulseTraceFlagBucketOverflow) != 0) {
        return false;
    }
    WaterPulseTraceBucketSample* buckets = new (std::nothrow) WaterPulseTraceBucketSample[trace.bucketCount]{};
    if (!buckets) {
        return false;
    }
    const bool copied = copyRamTraceBuckets(trace, buckets, trace.bucketCount);
    if (copied) {
        const WaterPulseTraceAnalysis analysis =
            analyzeWaterPulseTrace(trace, buckets, trace.bucketCount, pulseAnalysisOptionsForWeb());
        if (analysis.stable && analysis.stablePulsePerSec > 0.0f) {
            stablePulsePerSec = analysis.stablePulsePerSec;
        }
    }
    delete[] buckets;
    return stablePulsePerSec > 0.0f;
}

float recentStablePulsePerSec() {
    const StablePulseEstimateCache key = stablePulseCacheKey();
    if (stablePulseCacheMatches(key)) {
        return g_stablePulseEstimateCache.valid ? g_stablePulseEstimateCache.stablePulsePerSec : 0.0f;
    }
    float stablePulsePerSec = 0.0f;
    if (g_context.pulseTraces) {
        for (std::size_t offset = 0; offset < g_context.pulseTraces->count(); ++offset) {
            const std::size_t index = g_context.pulseTraces->count() - 1 - offset;
            const WaterPulseTrace* trace = g_context.pulseTraces->traceAt(index);
            if (trace && stablePulsePerSecFromTrace(*trace, stablePulsePerSec)) {
                g_stablePulseEstimateCache = key;
                g_stablePulseEstimateCache.ready = true;
                g_stablePulseEstimateCache.valid = true;
                g_stablePulseEstimateCache.stablePulsePerSec = stablePulsePerSec;
                return stablePulsePerSec;
            }
        }
    }
    g_stablePulseEstimateCache = stablePulseCacheKey();
    g_stablePulseEstimateCache.ready = true;
    g_stablePulseEstimateCache.valid = false;
    return 0.0f;
}

bool ensureMeteringSchemesReady() {
    return g_context.meteringSchemes && (g_context.meteringSchemes->ready() || g_context.meteringSchemes->begin());
}

const char* meteringSchemeSourceName(MeteringSchemeSource source) {
    switch (source) {
        case MeteringSchemeSource::Default:
            return "默认";
        case MeteringSchemeSource::CalibrationSession:
            return "校准生成";
        case MeteringSchemeSource::Manual:
            return "手工创建";
    }
    return "-";
}

const char* waterRecordFileStatusCode(WaterRecordFileStatus status) {
    switch (status) {
        case WaterRecordFileStatus::Ready:
            return "ready";
        case WaterRecordFileStatus::Unavailable:
            return "unavailable";
        case WaterRecordFileStatus::Missing:
            return "missing";
        case WaterRecordFileStatus::InvalidPath:
            return "invalid_path";
        case WaterRecordFileStatus::InvalidCapacity:
            return "invalid_capacity";
        case WaterRecordFileStatus::BackendFailure:
            return "backend_failure";
        case WaterRecordFileStatus::Corrupt:
            return "corrupt";
        case WaterRecordFileStatus::IncompatibleFormat:
            return "incompatible_format";
    }
    return "unknown";
}

