tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
const char* waterRecordFileStatusMessage(WaterRecordFileStatus status) {
    switch (status) {
        case WaterRecordFileStatus::Ready:
            return "记录存储正常。";
        case WaterRecordFileStatus::Missing:
            return "记录文件不存在，正在使用 RAM 临时记录；下次写入会尝试重新创建文件。";
        case WaterRecordFileStatus::InvalidPath:
            return "记录文件路径配置无效，正在使用 RAM 临时记录。";
        case WaterRecordFileStatus::InvalidCapacity:
            return "记录文件容量配置无效，正在使用 RAM 临时记录。";
        case WaterRecordFileStatus::BackendFailure:
            return "记录文件读写失败，正在使用 RAM 临时记录；请检查 Flash 文件系统。";
        case WaterRecordFileStatus::Corrupt:
            return "记录文件损坏或不完整，正在使用 RAM 临时记录。";
        case WaterRecordFileStatus::IncompatibleFormat:
            return "记录文件格式不兼容，正在使用 RAM 临时记录。";
        case WaterRecordFileStatus::Unavailable:
        default:
            return "记录存储不可用。";
    }
}

const char* appStorageStatusCode(AppStorageStatus status) {
    switch (status) {
        case AppStorageStatus::Ready:
            return "ready";
        case AppStorageStatus::Unavailable:
            return "unavailable";
        case AppStorageStatus::Missing:
            return "missing";
        case AppStorageStatus::InvalidPath:
            return "invalid_path";
        case AppStorageStatus::BackendFailure:
            return "backend_failure";
        case AppStorageStatus::Corrupt:
            return "corrupt";
        case AppStorageStatus::IncompatibleFormat:
            return "incompatible_format";
    }
    return "unknown";
}

const char* appStorageStatusMessage(AppStorageStatus status) {
    switch (status) {
        case AppStorageStatus::Ready:
            return "存储正常。";
        case AppStorageStatus::Missing:
            return "文件缺失；系统会在下次需要写入时尝试重新创建。";
        case AppStorageStatus::InvalidPath:
            return "文件路径配置无效。";
        case AppStorageStatus::BackendFailure:
            return "文件系统读写失败，请检查 Flash/LittleFS 状态。";
        case AppStorageStatus::Corrupt:
            return "文件损坏或未写完整；为保护已有数据，系统不会自动删除。";
        case AppStorageStatus::IncompatibleFormat:
            return "文件格式不兼容；为保护可识别数据，系统不会自动删除。";
        case AppStorageStatus::Unavailable:
        default:
            return "存储尚未就绪。";
    }
}

bool activeMeteringSchemeForWeb(MeteringSchemeRecord& output) {
    if (ensureMeteringSchemesReady() && g_context.meteringSchemes->activeScheme(output)) {
        return true;
    }
    if (g_context.app) {
        output = g_context.app->activeMeteringScheme();
        return output.recordUsed;
    }
    return false;
}

bool setAndApplyActiveMeteringSchemeForWeb(std::uint32_t schemeId) {
    if (!g_context.meteringSchemes || !g_context.app) {
        return false;
    }
    MeteringSchemeRecord next{};
    if (!g_context.meteringSchemes->findById(schemeId, next) || !validMeteringSchemeParameters(next.params)) {
        return false;
    }
    const std::uint32_t previousId = g_context.meteringSchemes->activeSchemeId();
    const MeteringSchemeRecord previous = g_context.app->activeMeteringScheme();
    const std::uint32_t now = g_context.nowSeconds ? g_context.nowSeconds() : 0;
    if (!g_context.meteringSchemes->setActiveScheme(schemeId, now)) {
        return false;
    }
    if (g_context.app->applyActiveMeteringScheme(next)) {
        return true;
    }
    if (previousId != 0 && previous.recordUsed) {
        g_context.meteringSchemes->setActiveScheme(previousId, now);
        g_context.app->applyActiveMeteringScheme(previous);
    }
    return false;
}

const char* traceStateText(WaterPulseTraceState state) {
    switch (state) {
        case WaterPulseTraceState::Running:
            return "运行";
        case WaterPulseTraceState::Paused:
            return "暂停";
        case WaterPulseTraceState::Completed:
            return "完成";
        case WaterPulseTraceState::Stopped:
            return "停止";
        case WaterPulseTraceState::PauseTimeout:
            return "暂停超时";
        case WaterPulseTraceState::SafetyStopped:
            return "安全停止";
        case WaterPulseTraceState::Error:
        default:
            return "异常";
    }
}

void sendPlainTextResponse(int status, const char* body) {
    Esp32BaseWeb::sendResponseHeader("Cache-Control", "no-store");
    Esp32BaseWeb::sendResponseHeader("X-Content-Type-Options", "nosniff");
    if (!Esp32BaseWeb::beginResponse(status, "text/plain; charset=utf-8", nullptr)) {
        return;
    }
    Esp32BaseWeb::sendChunk(body ? body : "");
    Esp32BaseWeb::endResponse();
}

void sendDurationUs(std::uint32_t us) {
    if (us >= 1000000UL) {
        sendFmt("%lu.%03lu s",
                static_cast<unsigned long>(us / 1000000UL),
                static_cast<unsigned long>((us % 1000000UL) / 1000UL));
    } else if (us >= 1000UL) {
        sendFmt("%lu.%03lu ms",
                static_cast<unsigned long>(us / 1000UL),
                static_cast<unsigned long>(us % 1000UL));
    } else {
        sendFmt("%lu us", static_cast<unsigned long>(us));
    }
}

void sendDurationSeconds(std::uint32_t us) {
    sendFmt("%lu.%03lu 秒",
            static_cast<unsigned long>(us / 1000000UL),
            static_cast<unsigned long>((us % 1000000UL) / 1000UL));
}

std::size_t startupEdgePreviewCount(const WaterPulseTrace& trace) {
    return std::min(trace.startupEdgeCount, kStartupEdgePreviewCount);
}

std::uint32_t bucketRunningPulseDelta(const WaterPulseTraceBucket& bucket) {
    return bucket.pulseDelta;
}

void formatKb(std::size_t bytes, char* out, std::size_t len) {
    const std::uint32_t tenths = static_cast<std::uint32_t>((bytes * 10U + 512U) / 1024U);
    std::snprintf(out, len, "%lu.%luKB", static_cast<unsigned long>(tenths / 10U),
                  static_cast<unsigned long>(tenths % 10U));
}

void sendMeteringTrialButton(const char* label,
                             const MeteringParameters& params,
                             std::uint32_t defaultMl,
                             std::uint32_t defaultSec,
                             const char* className = "btn-link") {
    (void)defaultMl;
    (void)defaultSec;
    sendFmt("<button class='%s' type='button' data-metering-trial='1' data-trial-label='",
            className ? className : "btn-link");
    sendHtmlAttrEscaped(label ? label : "计量方案");
    sendFmt("' data-startup-pulses='%lu' data-startup-volume='%lu' data-stable-ppl='%lu' "
            "data-startup-duration-ms='%lu' data-stable-flow-ml-min='%lu' "
            "data-default-ml='1000' data-default-sec='60' onclick='faucetOpenMeteringTrial(this)'>测算</button>",
            static_cast<unsigned long>(params.startupPulseCount),
            static_cast<unsigned long>(params.startupVolumeMl),
            static_cast<unsigned long>(params.stablePulsePerLiter),
            static_cast<unsigned long>(params.startupDurationMs),
            static_cast<unsigned long>(params.stableFlowMlPerMin));
}

void formatSchemeTimestamp(std::uint32_t seconds, char* out, std::size_t len) {
    if (!out || len == 0) {
        return;
    }
    if (seconds == 0) {
        std::snprintf(out, len, "-");
        return;
    }
    if (seconds >= kMinRealDateSeconds) {
        formatRecordTime(seconds, out, len);
        return;
    }
    std::snprintf(out, len, "开机+%lu s", static_cast<unsigned long>(seconds));
}

void sendSchemeDetailAttr(const char* name, const char* value) {
    sendFmt(" data-detail-%s='", name);
    sendHtmlAttrEscaped(value ? value : "-");
    Esp32BaseWeb::sendChunk("'");
}

void sendSchemeDetailButton(const MeteringSchemeRecord& scheme, std::uint32_t activeId) {
    char startupVolume[24]{};
    char stableFlow[24]{};
    char minActual[24]{};
    char maxActual[24]{};
    char maxError[24]{};
    char actualRange[56]{};
    char startupDuration[24]{};
    char createdAt[40]{};
    char status[64]{};
    formatLiters(scheme.params.startupVolumeMl, startupVolume, sizeof(startupVolume));
    formatFlowLitersPerMin(scheme.params.stableFlowMlPerMin, stableFlow, sizeof(stableFlow));
    formatStartupDurationSeconds(scheme.params.startupDurationMs, startupDuration, sizeof(startupDuration));
    formatLiters(scheme.minActualMl, minActual, sizeof(minActual));
    formatLiters(scheme.maxActualMl, maxActual, sizeof(maxActual));
    formatLiters(scheme.maxErrorMl, maxError, sizeof(maxError));
    if (scheme.minActualMl > 0 || scheme.maxActualMl > 0) {
        std::snprintf(actualRange, sizeof(actualRange), "%s - %s", minActual, maxActual);
    } else {
        std::snprintf(actualRange, sizeof(actualRange), "-");
    }
    formatSchemeTimestamp(scheme.createdAt, createdAt, sizeof(createdAt));
    std::snprintf(status,
                  sizeof(status),
                  "%s",
                  scheme.id == activeId ? "当前参数" : "历史参数");

    Esp32BaseWeb::sendChunk("<button class='btn-link' type='button' data-scheme-detail='1'");
    sendFmt(" data-detail-id='%lu' data-detail-startup-pulses='%luP' "
            "data-detail-stable-ppl='%luP/L' data-detail-startup-duration='%s' "
            "data-detail-sample-count='%u 条'",
            static_cast<unsigned long>(scheme.id),
            static_cast<unsigned long>(scheme.params.startupPulseCount),
            static_cast<unsigned long>(scheme.params.stablePulsePerLiter),
            startupDuration,
            static_cast<unsigned>(scheme.sampleCount));
    sendSchemeDetailAttr("name", scheme.name);
    sendSchemeDetailAttr("status", status);
    sendSchemeDetailAttr("source", meteringSchemeSourceName(scheme.sourceType));
    sendSchemeDetailAttr("created-at", createdAt);
    sendSchemeDetailAttr("startup-volume", startupVolume);
    sendSchemeDetailAttr("stable-flow", stableFlow);
    sendSchemeDetailAttr("actual-range", actualRange);
    sendFmt(" data-detail-max-error='");
    sendHtmlAttrEscaped(maxError);
    sendFmt(" / %u.%u%%'",
            static_cast<unsigned>(scheme.maxErrorTenthPercent / 10U),
            static_cast<unsigned>(scheme.maxErrorTenthPercent % 10U));
    Esp32BaseWeb::sendChunk(" onclick='faucetOpenSchemeDetail(this)'>详情</button>");
}

