tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
void sendSchemeDetailModal() {
    Esp32BaseWeb::sendChunk("<div id='scheme-detail-modal' class='scheme-detail-modal' aria-hidden='true'>"
                            "<div class='scheme-detail-card'><div class='panel-head'><h3>方案详情</h3>"
                            "<button class='btn-link' type='button' onclick='faucetCloseSchemeDetail()'>关闭</button></div>"
                            "<table class='kv scheme-detail-kv'>"
                            "<tr><th>ID</th><td data-scheme-detail-field='id'>-</td></tr>"
                            "<tr><th>名称</th><td data-scheme-detail-field='name'>-</td></tr>"
                            "<tr><th>状态</th><td data-scheme-detail-field='status'>-</td></tr>"
                            "<tr><th>来源</th><td data-scheme-detail-field='source'>-</td></tr>"
                            "<tr><th>创建时间</th><td data-scheme-detail-field='createdAt'>-</td></tr>"
                            "<tr><th>容量估算参数</th><td><span data-scheme-detail-field='startupPulses'>-</span> / <span data-scheme-detail-field='startupVolume'>-</span> / <span data-scheme-detail-field='stablePpl'>-</span></td></tr>"
                            "<tr><th>时间估算参数</th><td><span data-scheme-detail-field='startupDuration'>-</span> / <span data-scheme-detail-field='stableFlow'>-</span></td></tr>"
                            "<tr><th>样本数量</th><td data-scheme-detail-field='sampleCount'>-</td></tr>"
                            "<tr><th>容量范围</th><td data-scheme-detail-field='actualRange'>-</td></tr>"
                            "<tr><th>最大误差</th><td data-scheme-detail-field='maxError'>-</td></tr>"
                            "</table></div></div>");
}

void sendMeteringMetricCard(const char* label, const char* value) {
    Esp32BaseWeb::sendChunk("<div class='metering-metric'><span>");
    Esp32BaseWeb::sendChunk(label ? label : "");
    Esp32BaseWeb::sendChunk("</span><strong>");
    Esp32BaseWeb::sendChunk(value ? value : "-");
    Esp32BaseWeb::sendChunk("</strong></div>");
}

void sendActiveMeteringSchemeCard(const MeteringSchemeRecord& scheme, std::uint32_t activeId) {
    char startupPulses[24]{};
    char startupVolume[24]{};
    char stablePpl[24]{};
    char startupDuration[24]{};
    char stableFlow[24]{};
    char samples[24]{};
    char actualRange[56]{};
    char maxError[32]{};
    char meta[120]{};
    char minActual[24]{};
    char maxActual[24]{};
    char maxErrorMl[24]{};
    formatLiters(scheme.params.startupVolumeMl, startupVolume, sizeof(startupVolume));
    formatFlowLitersPerMin(scheme.params.stableFlowMlPerMin, stableFlow, sizeof(stableFlow));
    formatLiters(scheme.minActualMl, minActual, sizeof(minActual));
    formatLiters(scheme.maxActualMl, maxActual, sizeof(maxActual));
    formatLiters(scheme.maxErrorMl, maxErrorMl, sizeof(maxErrorMl));
    std::snprintf(startupPulses, sizeof(startupPulses), "%luP", static_cast<unsigned long>(scheme.params.startupPulseCount));
    std::snprintf(stablePpl, sizeof(stablePpl), "%luP/L", static_cast<unsigned long>(scheme.params.stablePulsePerLiter));
    formatStartupDurationSeconds(scheme.params.startupDurationMs, startupDuration, sizeof(startupDuration));
    std::snprintf(samples, sizeof(samples), "%u 条", static_cast<unsigned>(scheme.sampleCount));
    if (scheme.minActualMl > 0 || scheme.maxActualMl > 0) {
        std::snprintf(actualRange, sizeof(actualRange), "%s - %s", minActual, maxActual);
    } else {
        std::snprintf(actualRange, sizeof(actualRange), "-");
    }
    std::snprintf(maxError,
                  sizeof(maxError),
                  "%s / %u.%u%%",
                  maxErrorMl,
                  static_cast<unsigned>(scheme.maxErrorTenthPercent / 10U),
                  static_cast<unsigned>(scheme.maxErrorTenthPercent % 10U));
    std::snprintf(meta,
                  sizeof(meta),
                  "#%lu · %s",
                  static_cast<unsigned long>(scheme.id),
                  meteringSchemeSourceName(scheme.sourceType));

    Esp32BaseWeb::sendChunk("<section class='panel active-metering-card'><div class='panel-head'><div><h3><span>当前计量参数</span></h3><p class='active-metering-name'>");
    sendHtmlEscapedBounded(scheme.name, sizeof(scheme.name));
    Esp32BaseWeb::sendChunk("</p><p class='hint'>");
    Esp32BaseWeb::sendChunk(meta);
    Esp32BaseWeb::sendChunk("</p></div>");
    sendFmt("<span class='status-pill %s'>%s</span></div><div class='active-metering-metrics'>",
            scheme.id == activeId ? "status-ok" : "status-warn",
            scheme.id == activeId ? "当前参数" : "当前参数异常");
    sendMeteringMetricCard("启动脉冲", startupPulses);
    sendMeteringMetricCard("启动水量", startupVolume);
    sendMeteringMetricCard("稳态 P/L", stablePpl);
    sendMeteringMetricCard("启动时长", startupDuration);
    sendMeteringMetricCard("稳态流速", stableFlow);
    sendMeteringMetricCard("样本", samples);
    sendMeteringMetricCard("容量范围", actualRange);
    sendMeteringMetricCard("最大误差", maxError);
    Esp32BaseWeb::sendChunk("</div><div class='row-actions active-metering-actions'>");
    sendSchemeDetailButton(scheme, activeId);
    sendMeteringTrialButton(scheme.name[0] ? scheme.name : "当前计量参数", scheme.params, 1000, 10);
    sendManualParameterLink("复制参数", scheme);
    Esp32BaseWeb::sendChunk("</div></section>");
}

void sendActiveMeteringSchemeSummaryPanel() {
    MeteringSchemeRecord active{};
    bool activeReady = false;
    if (g_context.app) {
        active = g_context.app->activeMeteringScheme();
        activeReady = active.recordUsed;
    }
    if (!activeReady && activeMeteringSchemeForWeb(active)) {
        activeReady = true;
    }
    if (activeReady) {
        sendActiveMeteringSchemeCard(active, active.id);
        return;
    }
    Esp32BaseWeb::sendChunk("<section class='panel active-metering-card'><div class='panel-head'><div><h3><span>当前计量参数</span></h3>"
                            "<p class='active-metering-name'>-</p><p class='hint'>计量方案尚未就绪。</p></div>"
                            "<span class='status-pill status-muted'>无可用参数</span></div></section>");
}

