tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
    CalibrationStoredTrace stored{};
    const bool hasStoredTrace = g_context.calibrationSessionTraces && g_context.calibrationSessionTraces->ready() &&
                                attempt.sessionTraceSlot < kCalibrationSessionTraceSlots &&
                                g_context.calibrationSessionTraces->load(attempt.sessionTraceSlot, stored);
    std::uint32_t firstWindowPulses = 0;
    bool firstWindowReady = false;
    if (hasStoredTrace && samplePulseWindowSec > 0 && stored.trace.bucketCount > 0) {
        WaterPulseTraceBucketSample* traceBuckets =
            new (std::nothrow) WaterPulseTraceBucketSample[stored.trace.bucketCount]{};
        if (traceBuckets) {
            const std::size_t copied = g_context.calibrationSessionTraces->readBuckets(
                attempt.sessionTraceSlot, traceBuckets, stored.trace.bucketCount);
            if (copied == stored.trace.bucketCount) {
                const std::size_t windowBuckets =
                    static_cast<std::size_t>((samplePulseWindowSec * 1000UL + kPulseTraceBucketMs - 1UL) /
                                             kPulseTraceBucketMs);
                const std::size_t count = std::min(copied, windowBuckets);
                for (std::size_t i = 0; i < count; ++i) {
                    firstWindowPulses += traceBuckets[i].pulseCount;
                }
                firstWindowReady = true;
            }
            delete[] traceBuckets;
        }
    }
    const bool stableReady =
        attempt.status == CalibrationAttemptStatus::Valid &&
        attempt.summary.usableForGeneration &&
        attempt.summary.stable &&
        attempt.summary.stablePulseCount > 0 &&
        !attempt.summary.resumedAfterPause &&
        !attempt.summary.truncated;
    sendFmt("<tr><td>%s</td><td>%s</td><td>%s</td><td>%s</td><td>%s</td><td>%luP</td><td>",
            timeText,
            durationText,
            attempt.targetHintMl > 0 ? targetText : "-",
            attempt.record.volumeMl > 0 ? estimateText : "-",
            actualText,
            static_cast<unsigned long>(attempt.record.pulseCount));
    if (firstWindowReady) {
        sendFmt("%luP", static_cast<unsigned long>(firstWindowPulses));
    } else {
        Esp32BaseWeb::sendChunk("-");
    }
    Esp32BaseWeb::sendChunk("</td><td>");
    sendCalibrationAttemptTraceLink(attempt);
    const bool savedOnly = attempt.status == CalibrationAttemptStatus::Valid && !stableReady;
    sendFmt("</td><td><span class='status-pill %s'>%s</span></td><td>本次会话 #%u</td><td><span class='status-pill %s'>%s</span>",
            stableReady ? "status-ok" : (attempt.status == CalibrationAttemptStatus::Invalid ? "status-warn" : "status-muted"),
            stableReady ? "稳态可用" : (attempt.status == CalibrationAttemptStatus::Invalid ? calibrationInvalidReasonText(attempt.invalidReason) : (savedOnly ? "仅记录" : "-")),
            static_cast<unsigned>(attempt.attemptIndex + 1),
            attempt.status == CalibrationAttemptStatus::Valid ? "status-ok" :
                (attempt.status == CalibrationAttemptStatus::Invalid ? "status-warn" : "status-muted"),
            calibrationAttemptStatusText(attempt.status));
    Esp32BaseWeb::sendChunk("</td><td>");
    bool renderedAction = false;
    if (attempt.status == CalibrationAttemptStatus::Valid || attempt.status == CalibrationAttemptStatus::PendingActual) {
        Esp32BaseWeb::sendChunk("<form method='post' action='/faucet/calibration/flow' onsubmit='return faucetSubmitFlowCalibrationAction(this)'>"
                                "<input type='hidden' name='action' value='remove_sample'>"
                                "<input type='hidden' name='attemptIndex' value='");
        sendFmt("%u", static_cast<unsigned>(attempt.attemptIndex));
        Esp32BaseWeb::sendChunk("'><input class='danger' type='submit' value='移除'></form>");
        renderedAction = true;
    }
    if (!renderedAction) {
        Esp32BaseWeb::sendChunk("<span class='hint'>无可用操作</span>");
    }
    Esp32BaseWeb::sendChunk("</td></tr>");
}

void sendCalibrationSamplesPanel(std::uint32_t samplePulseWindowSec) {
    Esp32BaseWeb::sendChunk("<section id='calibration-samples' class='panel'><div class='panel-head'><h3>本次校准样本</h3></div>"
                            "<p class='hint'>这里记录当前校准会话的接水记录；有效样本会自动刷新推荐参数，异常或误操作样本可移除。</p>");
    sendFmt("<table class='calibration-sample-table'><tr><th>时间</th><th>时长</th><th>目标容量</th><th>估算出水</th><th>量杯实测</th><th>总脉冲</th><th>前 %u 秒脉冲</th><th>脉冲明细</th><th>稳态识别</th><th>样本来源</th><th>校准用途</th><th>操作</th></tr>",
            static_cast<unsigned>(samplePulseWindowSec));
    if (!g_context.calibrationSessions || !g_context.calibrationSessions->ready()) {
        Esp32BaseWeb::sendChunk("<tr><td colspan='12'>校准会话存储未就绪，暂时不能读取本次接水记录。</td></tr></table></section>");
        return;
    }
    std::unique_ptr<CalibrationSessionRecord> session(new (std::nothrow) CalibrationSessionRecord);
    if (!session) {
        Esp32BaseWeb::sendChunk("<tr><td colspan='12'>内存不足，暂时不能读取本次校准样本。</td></tr></table></section>");
        return;
    }
    if (!g_context.calibrationSessions->load(*session) || session->attemptCount == 0) {
        Esp32BaseWeb::sendChunk("<tr><td colspan='12'>还没有本次校准样本。进入校准模式后，每次本地出水都会记录到这里。</td></tr></table></section>");
        return;
    }
    bool rendered = false;
    for (std::uint8_t i = 0; i < session->attemptCount && i < kCalibrationMaxAttempts; ++i) {
        const CalibrationAttempt& attempt = session->attempts[i];
        if (attempt.status == CalibrationAttemptStatus::Empty) {
            continue;
        }
        sendCalibrationSessionAttemptRow(*session, attempt, samplePulseWindowSec);
        rendered = true;
    }
    if (!rendered) {
        Esp32BaseWeb::sendChunk("<tr><td colspan='12'>还没有本次校准样本。进入校准模式后，每次本地出水都会记录到这里。</td></tr>");
    }
    Esp32BaseWeb::sendChunk("</table></section>");
}

const char* calibrationSessionStatusCode(CalibrationSessionStatus status) {
    switch (status) {
        case CalibrationSessionStatus::Idle:
            return "idle";
        case CalibrationSessionStatus::Preparing:
            return "preparing";
        case CalibrationSessionStatus::WaitingLocalRun:
            return "waitingLocalRun";
        case CalibrationSessionStatus::Running:
            return "running";
        case CalibrationSessionStatus::AwaitingActual:
            return "awaitingActual";
        case CalibrationSessionStatus::ReadyToGenerate:
            return "readyToGenerate";
        case CalibrationSessionStatus::Generated:
            return "generated";
        case CalibrationSessionStatus::Applied:
            return "applied";
        case CalibrationSessionStatus::Discarded:
            return "discarded";
        case CalibrationSessionStatus::Failed:
            return "failed";
    }
    return "unknown";
}

void sendGeneratedMeteringCandidatePanel(const MeteringSchemeCandidate& candidate) {
    if (!candidate.ready) {
        return;
    }
    char startupPulses[24]{};
    char startupVolume[24]{};
    char stablePpl[24]{};
    char startupDuration[24]{};
    char stableFlow[24]{};
    char generatedAt[40]{};
    char samples[24]{};
    char minActual[24]{};
    char maxActual[24]{};
    char actualRange[56]{};
    char maxErrorMl[24]{};
    char maxError[40]{};
    std::snprintf(startupPulses,
                  sizeof(startupPulses),
                  "%luP",
                  static_cast<unsigned long>(candidate.params.startupPulseCount));
    formatLiters(candidate.params.startupVolumeMl, startupVolume, sizeof(startupVolume));
    std::snprintf(stablePpl,
                  sizeof(stablePpl),
                  "%luP/L",
                  static_cast<unsigned long>(candidate.params.stablePulsePerLiter));
    formatStartupDurationSeconds(candidate.params.startupDurationMs, startupDuration, sizeof(startupDuration));
    formatFlowLitersPerMin(candidate.params.stableFlowMlPerMin, stableFlow, sizeof(stableFlow));
    formatSchemeTimestamp(candidate.generatedAt, generatedAt, sizeof(generatedAt));
    std::snprintf(samples, sizeof(samples), "%u 条", static_cast<unsigned>(candidate.sampleCount));
    formatLiters(candidate.minActualMl, minActual, sizeof(minActual));
    formatLiters(candidate.maxActualMl, maxActual, sizeof(maxActual));
    if (candidate.minActualMl > 0 || candidate.maxActualMl > 0) {
        std::snprintf(actualRange, sizeof(actualRange), "%s - %s", minActual, maxActual);
    } else {
        std::snprintf(actualRange, sizeof(actualRange), "-");
    }
    formatLiters(candidate.maxErrorMl, maxErrorMl, sizeof(maxErrorMl));
    std::snprintf(maxError,
                  sizeof(maxError),
                  "%s / %u.%u%%",
                  maxErrorMl,
                  static_cast<unsigned>(candidate.maxErrorTenthPercent / 10U),
                  static_cast<unsigned>(candidate.maxErrorTenthPercent % 10U));

    Esp32BaseWeb::sendChunk("<div class='generated-metering-candidate'><div class='panel-head'><div><h4>推荐计量参数</h4>"
                            "<p class='hint'>确认前请核对这组自动生成的参数。</p></div>"
                            "<span class='status-pill status-ok'>待应用</span></div>"
                            "<div class='active-metering-metrics'>");
    sendMeteringMetricCard("启动脉冲", startupPulses);
    sendMeteringMetricCard("启动水量", startupVolume);
    sendMeteringMetricCard("稳态 P/L", stablePpl);
    sendMeteringMetricCard("启动时长", startupDuration);
    sendMeteringMetricCard("稳态流速", stableFlow);
    sendMeteringMetricCard("生成来源", meteringSchemeSourceName(candidate.sourceType));
    sendMeteringMetricCard("生成时间", generatedAt);
    sendMeteringMetricCard("样本数", samples);
    sendMeteringMetricCard("容量范围", actualRange);
    sendMeteringMetricCard("最大误差", maxError);
    Esp32BaseWeb::sendChunk("</div></div>");
}

