tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
void sendFlowCalibrationSessionPanel(const AppSnapshot& snapshot, bool taskActive) {
    const bool sessionActive = snapshot.calibrationStatus != CalibrationSessionStatus::Idle &&
                               snapshot.calibrationStatus != CalibrationSessionStatus::Applied &&
                               snapshot.calibrationStatus != CalibrationSessionStatus::Discarded &&
                               snapshot.calibrationStatus != CalibrationSessionStatus::Failed;
    const bool canStartSession = calibrationSessionInactive(snapshot.calibrationStatus) && !taskActive;
    const bool canDiscardSession = sessionActive && snapshot.calibrationStatus != CalibrationSessionStatus::Running && !taskActive;
    const bool canEnterActual = snapshot.calibrationStatus == CalibrationSessionStatus::AwaitingActual;
    const bool canApply = snapshot.calibrationStatus == CalibrationSessionStatus::Generated && !taskActive;
    const bool autoRefreshSession =
        snapshot.calibrationStatus == CalibrationSessionStatus::WaitingLocalRun ||
        snapshot.calibrationStatus == CalibrationSessionStatus::Running;

    sendFmt("<section id='calibration-session' class='panel calibration-session-panel' data-calibration-status='%s' data-calibration-valid-samples='%u'>"
            "<div class='panel-head'><h3>校准流程</h3><div class='calibration-session-badges'>",
            calibrationSessionStatusCode(snapshot.calibrationStatus),
            static_cast<unsigned>(snapshot.calibrationValidSampleCount));
    sendFmt("<span class='status-pill %s'%s>%s</span>",
            sessionActive ? "status-warn" : "status-muted",
            autoRefreshSession ? " data-calibration-refresh" : "",
            calibrationSessionStatusText(snapshot.calibrationStatus));
    Esp32BaseWeb::sendChunk("</div></div><p class='muted'>至少 2 条有效样本后会自动生成参数；3 条以上更稳。到设备旁按 OK 开始校准出水，按 CANCEL 停止；网页只录入量杯读数并处理样本。</p>");
    if (snapshot.calibrationStatus == CalibrationSessionStatus::WaitingLocalRun) {
        Esp32BaseWeb::sendChunk("<p class='ok'>设备正在等待本地 OK 开始校准出水。页面会自动刷新状态。</p>");
    } else if (snapshot.calibrationStatus == CalibrationSessionStatus::Running) {
        Esp32BaseWeb::sendChunk("<p class='warn'>校准出水中。请在设备本地按 CANCEL 停止，停止后网页会进入实测容量录入。</p>");
    } else if (snapshot.calibrationStatus == CalibrationSessionStatus::AwaitingActual) {
        Esp32BaseWeb::sendChunk("<p class='ok'>本次出水已停止，请按量杯读数填写实测容量。</p>");
    } else if (snapshot.calibrationStatus == CalibrationSessionStatus::Generated) {
        Esp32BaseWeb::sendChunk("<p class='ok'>已自动计算出参数建议；可以继续按 OK 补充样本，或确认使用这组参数。</p>");
    }
    Esp32BaseWeb::sendChunk("<div class='form-actions calibration-primary-actions'>");
    if (!sessionActive) {
        Esp32BaseWeb::sendChunk("<form method='post' action='/faucet/calibration/flow' onsubmit='return once(this)'>"
                                "<input type='hidden' name='action' value='start_session'>");
        sendFmt("<input class='primary' type='submit' value='开始校准流程'%s></form>",
                canStartSession ? "" : " disabled");
    } else {
        Esp32BaseWeb::sendChunk("<form method='post' action='/faucet/calibration/flow' onsubmit=\"return confirm('确认退出并丢弃本次校准会话？')&&once(this)\">"
                                "<input type='hidden' name='action' value='discard_session'>");
        sendFmt("<input class='secondary' type='submit' value='退出校准流程'%s></form>",
                canDiscardSession ? "" : " disabled");
    }
    Esp32BaseWeb::sendChunk("</div>");
    if (canEnterActual) {
        Esp32BaseWeb::sendChunk("<form class='sample-calibration-form' method='post' action='/faucet/calibration/flow' onsubmit='return faucetSubmitFlowCalibrationAction(this)'>"
                                "<input type='hidden' name='action' value='save_actual'>"
                                "<label class='compact-field'><span>本次实测容量</span><span class='estimator-input-row'>"
                                "<input name='actualMl' type='number' min='");
        sendFmt("%lu", static_cast<unsigned long>(kCalibrationMinActualMl));
        Esp32BaseWeb::sendChunk("' max='");
        sendFmt("%lu", static_cast<unsigned long>(kMaxVolumePresetMl));
        Esp32BaseWeb::sendChunk("' step='1' required><span class='unit-label'>ml</span></span></label>"
                                "<div class='form-actions'><input class='primary' type='submit' value='保存有效样本'></form>"
                                "<form method='post' action='/faucet/calibration/flow' onsubmit=\"return confirm('确认放弃本次出水样本？')&&faucetSubmitFlowCalibrationAction(this)\">"
                                "<input type='hidden' name='action' value='skip_attempt'>"
                                "<input class='danger' type='submit' value='放弃本次样本'></form></div>");
    }
    if (snapshot.calibrationStatus == CalibrationSessionStatus::Generated) {
        sendGeneratedMeteringCandidatePanel(snapshot.calibrationCandidate);
    }
    Esp32BaseWeb::sendChunk("<div class='form-actions calibration-secondary-actions'>"
                            "<form method='post' action='/faucet/calibration/flow' onsubmit=\"return confirm('确认使用这组计量参数？')&&once(this)\">"
                            "<input type='hidden' name='action' value='apply_session'>");
    sendFmt("<input class='primary' type='submit' value='使用这组参数'%s></form></div></section>",
            canApply ? "" : " disabled");
}

void formatSensorTemperature(const SensorValue& value, char* out, std::size_t len) {
    if (!out || len == 0) {
        return;
    }
    if (!value.valid) {
        std::snprintf(out, len, "-");
        return;
    }
    const std::int32_t centi = value.value;
    std::snprintf(out,
                  len,
                  "%ld.%02ld C",
                  static_cast<long>(centi / 100),
                  static_cast<long>(std::abs(static_cast<int>(centi % 100))));
}

void formatSensorIntegerValue(const SensorValue& value, const char* unit, char* out, std::size_t len) {
    if (!out || len == 0) {
        return;
    }
    if (!value.valid) {
        std::snprintf(out, len, "-");
        return;
    }
    std::snprintf(out, len, "%ld %s", static_cast<long>(value.value), unit ? unit : "");
}

const char* tdsCalibrationModeText(TdsCalibrationMode mode) {
    switch (mode) {
        case TdsCalibrationMode::None:
            return "未校准";
        case TdsCalibrationMode::SinglePoint:
            return "单点";
        case TdsCalibrationMode::TwoPoint:
            return "两点";
        case TdsCalibrationMode::MultiPoint:
            return "多点";
    }
    return "未知";
}

void sendCalibrationCenterFlowCard(const AppSnapshot& snapshot) {
    MeteringSchemeRecord active{};
    const bool activeReady = activeMeteringSchemeForWeb(active);
    const MeteringParameters params = activeReady ? active.params : snapshot.meteringParams;
    const bool sessionActive = !calibrationSessionInactive(snapshot.calibrationStatus);
    Esp32BaseWeb::sendChunk("<section class='panel calibration-center-card'><div class='panel-head'><h3>当前计量参数</h3>");
    if (sessionActive) {
        sendFmt("<span class='status-pill status-warn'>%s</span></div>",
                calibrationSessionStatusText(snapshot.calibrationStatus));
    } else {
        sendFmt("<span class='status-pill status-ok'>%s</span></div>",
                activeReady && active.name[0] ? active.name : "默认参数");
    }
    Esp32BaseWeb::sendChunk("<div class='tds-calibration-summary'>");
    sendFmt("<div><span>启动脉冲</span><strong>%lu P</strong></div>",
            static_cast<unsigned long>(params.startupPulseCount));
    sendFmt("<div><span>启动水量</span><strong>%lu ml</strong></div>",
            static_cast<unsigned long>(params.startupVolumeMl));
    sendFmt("<div><span>启动时长</span><strong>%lu ms</strong></div>",
            static_cast<unsigned long>(params.startupDurationMs));
    sendFmt("<div><span>稳态 P/L</span><strong>%lu</strong></div>",
            static_cast<unsigned long>(params.stablePulsePerLiter));
    sendFmt("<div><span>稳态流速</span><strong>%lu ml/min</strong></div>",
            static_cast<unsigned long>(params.stableFlowMlPerMin));
    if (sessionActive) {
        sendFmt("<div><span>本次校准</span><strong>%u 样本</strong></div>",
                static_cast<unsigned>(snapshot.calibrationValidSampleCount));
    }
    Esp32BaseWeb::sendChunk("</div><div class='form-actions'>"
                            "<a class='btn-link primary' href='/faucet/calibration/flow'>");
    Esp32BaseWeb::sendChunk(sessionActive ? "继续流量计校准" : "进入流量计校准");
    Esp32BaseWeb::sendChunk("</a></div></section>");
}

void sendCalibrationCenterTemperatureCard(const AppSnapshot& snapshot, const SystemConfig& config) {
    char temperatureText[24]{};
    formatSensorTemperature(snapshot.sensors.temperatureCentiC, temperatureText, sizeof(temperatureText));
    const bool enabled = config.temperatureEnabled && config.temperatureKind == TemperatureKind::Ntc50kB3950;
    Esp32BaseWeb::sendChunk("<section class='panel calibration-center-card'><div class='panel-head'><h3>温度校准</h3>");
    sendFmt("<span class='status-pill %s'>%s</span></div>",
            enabled ? (config.temperatureCalibrated ? "status-ok" : "status-warn") : "status-muted",
            enabled ? (config.temperatureCalibrated ? "已校准" : "未校准") : "未启用");
    Esp32BaseWeb::sendChunk("<div class='tds-calibration-summary'>");
    sendFmt("<div><span>当前水温</span><strong>%s</strong></div>", enabled ? temperatureText : "未启用");
    sendFmt("<div><span>当前偏移</span><strong>%ld.%02ld C</strong></div>",
            static_cast<long>(config.temperatureOffsetCentiC / 100),
            static_cast<long>(std::abs(static_cast<int>(config.temperatureOffsetCentiC % 100))));
    Esp32BaseWeb::sendChunk("</div><p><a class='btn-link primary' href='/faucet/calibration?view=temperature'>进入温度校准</a></p></section>");
}

void sendCalibrationCenterTdsCard(const AppSnapshot& snapshot, const SystemConfig& config) {
    char tdsText[24]{};
    char voltageText[24]{};
    char tempText[24]{};
    formatSensorIntegerValue(snapshot.sensors.tdsPpm, "ppm", tdsText, sizeof(tdsText));
    formatSensorIntegerValue(snapshot.sensors.tdsVoltageMv, "mV", voltageText, sizeof(voltageText));
    formatSensorTemperature(snapshot.sensors.temperatureCentiC, tempText, sizeof(tempText));
    const bool enabled = config.tdsEnabled && config.tdsKind == TdsKind::AnalogTdsAo;
    Esp32BaseWeb::sendChunk("<section class='panel calibration-center-card'><div class='panel-head'><h3>水质校准</h3>");
    sendFmt("<span class='status-pill %s'>%s</span></div>",
            enabled ? (config.tdsCalibrated ? "status-ok" : "status-warn") : "status-muted",
            enabled ? (config.tdsCalibrated ? tdsCalibrationModeText(config.tdsCalibrationMode) : "未校准") : "未启用");
    Esp32BaseWeb::sendChunk("<div class='tds-calibration-summary'>");
    sendFmt("<div><span>当前 TDS</span><strong>%s</strong></div>", enabled ? tdsText : "未启用");
    sendFmt("<div><span>采样电压</span><strong>%s</strong></div>", enabled ? voltageText : "-");
    sendFmt("<div><span>水温补偿</span><strong>%s</strong></div>",
            config.tdsTemperatureCompensationEnabled ? tempText : "关闭");
    sendFmt("<div><span>scale</span><strong>%.3f</strong></div>", static_cast<double>(config.tdsScale));
    sendFmt("<div><span>offset</span><strong>%d ppm</strong></div>", static_cast<int>(config.tdsOffsetPpm));
    Esp32BaseWeb::sendChunk("</div><p><a class='btn-link primary' href='/faucet/calibration?view=tds'>进入水质校准</a></p></section>");
}

void sendTdsCalibrationPointsTable(const TdsCalibrationSessionSnapshot& session) {
    Esp32BaseWeb::sendChunk("<h4>已保存校准点</h4><table><tr><th>#</th><th>参考 ppm</th><th>原始 ppm</th><th>采样电压</th><th>操作</th></tr>");
    if (session.pointCount == 0) {
        Esp32BaseWeb::sendChunk("<tr><td colspan='5'>暂无校准点</td></tr>");
    }
    for (std::uint8_t i = 0; i < session.pointCount && i < kTdsCalibrationMaxPoints; ++i) {
        const TdsCalibrationPointSnapshot& point = session.points[i];
        sendFmt("<tr><td>%u</td><td>%u</td><td>%u</td><td>%u mV</td><td>"
                "<form method='post' action='/faucet/calibration' onsubmit='return once(this)'>"
                "<input type='hidden' name='action' value='tds_remove_point'>"
                "<input type='hidden' name='index' value='%u'>"
                "<input class='secondary' type='submit' value='删除'></form></td></tr>",
                static_cast<unsigned>(i + 1U),
                static_cast<unsigned>(point.referencePpm),
                static_cast<unsigned>(point.rawPpm),
                static_cast<unsigned>(point.voltageMv),
                static_cast<unsigned>(i));
    }
    Esp32BaseWeb::sendChunk("</table>");
}

