tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
void handleTemperatureCalibrationPage() {
    const AppSnapshot snapshot = g_context.app->snapshot();
    const SystemConfig& config = *g_context.config;
    char rawText[24]{};
    char calibratedText[24]{};
    formatSensorTemperature(snapshot.sensors.temperatureRawCentiC, rawText, sizeof(rawText));
    formatSensorTemperature(snapshot.sensors.temperatureCentiC, calibratedText, sizeof(calibratedText));
    const bool enabled = config.temperatureEnabled && config.temperatureKind == TemperatureKind::Ntc50kB3950;
    Esp32BaseWeb::sendHeader("温度校准");
    Esp32BaseWeb::sendChunk("<h2>温度校准</h2><p><a class='btn-link' href='/faucet/calibration'>返回校准中心</a></p>");
    sendNoticeFromQuery();
    Esp32BaseWeb::sendChunk("<section class='panel temperature-calibration-panel'><div class='panel-head'><h3>当前温度状态</h3>");
    sendFmt("<span class='status-pill %s'>%s</span></div>",
            enabled ? (config.temperatureCalibrated ? "status-ok" : "status-warn") : "status-muted",
            enabled ? (config.temperatureCalibrated ? "已校准" : "未校准") : "未启用");
    Esp32BaseWeb::sendChunk("<div class='temperature-calibration-summary'>");
    sendFmt("<div><span>原始温度</span><strong>%s</strong></div>", enabled ? rawText : "未启用");
    sendFmt("<div><span>当前水温</span><strong>%s</strong></div>", enabled ? calibratedText : "未启用");
    sendFmt("<div><span>当前偏移</span><strong>%ld.%02ld C</strong></div>",
            static_cast<long>(config.temperatureOffsetCentiC / 100),
            static_cast<long>(std::abs(static_cast<int>(config.temperatureOffsetCentiC % 100))));
    Esp32BaseWeb::sendChunk("</div><form class='temperature-calibration-form' method='post' action='/faucet/calibration' onsubmit='return once(this)'>"
                            "<input type='hidden' name='action' value='temperature_save'>"
                            "<label class='compact-field'><span>温度计读数</span><span class='estimator-input-row'>"
                            "<input name='referenceC' type='number' step='0.1' min='0' max='90' required>"
                            "<span class='unit-label'>C</span></span></label>"
                            "<p class='hint'>预览偏移只作辅助，保存时以后端当前原始温度重新计算。</p><div class='form-actions'>");
    sendFmt("<input class='primary' type='submit' value='保存温度校准'%s>",
            enabled && snapshot.sensors.temperatureRawCentiC.valid ? "" : " disabled");
    Esp32BaseWeb::sendChunk("<a class='btn-link' href='/faucet/calibration'>取消</a></div></form></section>");
    sendCalibrationPageScript();
    sendPageEnd();
}

void handleTdsCalibrationPage() {
    const AppSnapshot snapshot = g_context.app->snapshot();
    const SystemConfig& config = *g_context.config;
    const TdsCalibrationSessionSnapshot session =
        g_context.app ? g_context.app->tdsCalibrationSnapshot() : TdsCalibrationSessionSnapshot{};
    char tdsText[24]{};
    char voltageText[24]{};
    char tempText[24]{};
    formatSensorIntegerValue(snapshot.sensors.tdsPpm, "ppm", tdsText, sizeof(tdsText));
    formatSensorIntegerValue(snapshot.sensors.tdsVoltageMv, "mV", voltageText, sizeof(voltageText));
    formatSensorTemperature(snapshot.sensors.temperatureCentiC, tempText, sizeof(tempText));
    const bool enabled = config.tdsEnabled && config.tdsKind == TdsKind::AnalogTdsAo;
    const bool canWrite = enabled && !waterTaskActive();

    Esp32BaseWeb::sendHeader("水质校准");
    Esp32BaseWeb::sendChunk("<h2>水质校准</h2><p><a class='btn-link' href='/faucet/calibration'>返回校准中心</a></p>");
    sendNoticeFromQuery();
    Esp32BaseWeb::sendChunk("<section class='panel tds-calibration-panel'><div class='panel-head'><h3>当前水质状态</h3>");
    sendFmt("<span class='status-pill %s'>%s</span></div>",
            enabled ? (config.tdsCalibrated ? "status-ok" : "status-warn") : "status-muted",
            enabled ? (config.tdsCalibrated ? tdsCalibrationModeText(config.tdsCalibrationMode) : "未校准") : "未启用");
    Esp32BaseWeb::sendChunk("<div class='tds-calibration-summary'>");
    sendFmt("<div><span>当前 TDS</span><strong>%s</strong></div>", enabled ? tdsText : "未启用");
    sendFmt("<div><span>采样电压</span><strong>%s</strong></div>", enabled ? voltageText : "-");
    sendFmt("<div><span>水温补偿</span><strong>%s</strong></div>",
            config.tdsTemperatureCompensationEnabled ? tempText : "关闭");
    sendFmt("<div><span>scale</span><strong>%.3f</strong></div>", static_cast<double>(config.tdsScale));
    sendFmt("<div><span>offset</span><strong>%d ppm</strong></div>", static_cast<int>(config.tdsOffsetPpm));
    Esp32BaseWeb::sendChunk("</div></section><section class='panel tds-point-session'><div class='panel-head'><h3>本次校准</h3>");
    sendFmt("<span class='status-pill %s'>%s</span></div>",
            session.samplingActive ? "status-warn" : (session.sessionActive ? "status-ok" : "status-muted"),
            session.samplingActive ? "采样中" : (session.sessionActive ? "已开始" : "未开始"));
    Esp32BaseWeb::sendChunk("<div class='form-actions'><form method='post' action='/faucet/calibration' onsubmit='return once(this)'>"
                            "<input type='hidden' name='action' value='tds_start_session'>");
    sendFmt("<input class='primary' type='submit' value='开始校准'%s></form>",
            canWrite && !session.sessionActive ? "" : " disabled");
    Esp32BaseWeb::sendChunk("<form method='post' action='/faucet/calibration' onsubmit='return once(this)'>"
                            "<input type='hidden' name='action' value='tds_start_point'>"
                            "<label class='compact-field'><span>本次参考 ppm</span><span class='estimator-input-row'>"
                            "<input name='referencePpm' type='number' min='0' max='2000' step='1' required>"
                            "<span class='unit-label'>ppm</span></span></label>");
    sendFmt("<input class='secondary' type='submit' value='采集这个点'%s></form>",
            canWrite && session.sessionActive && !session.samplingActive && !session.full ? "" : " disabled");
    Esp32BaseWeb::sendChunk("<form method='post' action='/faucet/calibration' onsubmit='return once(this)'>"
                            "<input type='hidden' name='action' value='tds_save_point'>");
    sendFmt("<input class='secondary' type='submit' value='保存为校准点'%s></form>",
            canWrite && session.readyToSave ? "" : " disabled");
    Esp32BaseWeb::sendChunk("</div>");
    sendTdsCalibrationPointsTable(session);
    Esp32BaseWeb::sendChunk("<div class='tds-workflow-card'><h4>自动生成结果</h4>");
    if (session.candidateReady) {
        sendFmt("<p>点数 %u，参考跨度 %u ppm，原始跨度 %u ppm，scale %.3f，offset %d ppm。</p>",
                static_cast<unsigned>(session.pointCount),
                static_cast<unsigned>(session.referenceSpanPpm),
                static_cast<unsigned>(session.rawSpanPpm),
                static_cast<double>(session.candidateScale),
                static_cast<int>(session.candidateOffsetPpm));
    } else {
        Esp32BaseWeb::sendChunk("<p>保存至少一个稳定校准点后自动生成结果。</p>");
    }
    Esp32BaseWeb::sendChunk("<div class='form-actions'><form method='post' action='/faucet/calibration' onsubmit='return once(this)'>"
                            "<input type='hidden' name='action' value='tds_apply_session'>");
    sendFmt("<input class='primary' type='submit' value='使用这组参数'%s></form>",
            canWrite && session.candidateReady ? "" : " disabled");
    Esp32BaseWeb::sendChunk("<form method='post' action='/faucet/calibration' onsubmit='return once(this)'>"
                            "<input type='hidden' name='action' value='tds_discard_session'>");
    sendFmt("<input class='secondary' type='submit' value='丢弃本次校准'%s></form></div></div></section>",
            canWrite && session.sessionActive ? "" : " disabled");
    sendCalibrationPageScript();
    sendPageEnd();
}

