tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
void sendCalibrationPageScript() {
    Esp32BaseWeb::sendChunk("<script>"
                            "function faucetShowSampleCalibration(id){var rows=document.querySelectorAll('.sample-calibration-edit-row');for(var i=0;i<rows.length;i++)rows[i].classList.remove('is-open');var r=document.getElementById(id);if(r)r.classList.add('is-open');}"
                            "function faucetHideSampleCalibration(id){var r=document.getElementById(id);if(r)r.classList.remove('is-open');}"
                            "function faucetCalibrationErrorMessage(code){var m={busy:'设备正在出水或确认中，请回到待机后再保存。',invalid_value:'实际出水量超出允许范围，请按量杯读数填写。',invalid_action:'操作无效，请刷新页面后重试。',invalid_state:'现在不允许执行这个操作，请刷新页面后按当前步骤继续。',calibration_storage_unavailable:'校准存储未就绪，请检查设备存储空间或重启后再试。',sample_not_enough:'可用样本不足，至少需要两条有效样本。',no_calibration_record:'这条样本不可校准：没有可用脉冲明细或结束状态不适合校准。',calibration_mark_failed:'实测容量写入失败，可能是校准记录存储不可用或 Flash 写入失败。',save_failed:'样本保存失败，请检查样本容量或存储状态。','HTTP 401':'认证已失效，请刷新页面重新登录。','HTTP 403':'认证被拒绝，请检查 Web 登录状态。','HTTP 404':'保存接口路径不存在，请刷新页面后重试。','HTTP 500':'设备端保存接口异常，请查看日志。','HTTP 503':'设备尚未就绪，请稍后重试。'};return m[code]||(code?'操作失败：'+code:'操作失败，请检查页面状态后重试。');}"
                            "function faucetReadCalibrationError(r){return r.text().then(function(t){try{return (JSON.parse(t)||{}).error||('HTTP '+r.status);}catch(e){return 'HTTP '+r.status;}});}"
                            "function faucetResetSampleCalibrationForm(f){f.dataset.busy='';var b=f.querySelector('[type=submit]');if(b)b.disabled=false;}"
                            "function faucetFormatEstimateSeconds(s){if(!isFinite(s)||s<=0)return '-';s=Math.max(1,Math.round(s));var m=Math.floor(s/60),r=s%60;return m>0?(m+'分'+r+'秒'):(r+'秒');}"
                            "function faucetFormatStartupSeconds(ms){ms=Number(ms)||0;if(ms%1000===0)return Math.floor(ms/1000)+'秒';return (ms/1000).toFixed(3).replace(/0+$/,'').replace(/\\.$/,'')+'秒';}"
                            "function faucetFormatTrialLiters(ml){ml=Math.max(0,Math.round(Number(ml)||0));var l=Math.floor(ml/1000),r=String(ml%1000).padStart(3,'0');return l+'.'+r+' L';}"
                            "function faucetEstimatePulsesForMl(ml,ns,vs,ps){if(!(ml>0&&ps>0))return 0;if(ns>0&&vs>0&&ml<=vs)return Math.ceil(ml*ns/vs);return ns+Math.ceil(Math.max(0,ml-vs)*ps/1000);}"
                            "function faucetEstimateDurationForMl(ml,vs,ts,flow){if(!(ml>0&&flow>0))return 0;if(!(ts>0&&vs>0))return ml*60/flow;if(ml<=vs)return ml*ts/1000/vs;return ts/1000+(ml-vs)*60/flow;}"
                            "function faucetEstimateVolumeForDuration(sec,vs,ts,flow){if(!(sec>0&&flow>0))return 0;var ms=sec*1000;if(ts>0&&vs>0&&ms<=ts)return Math.round(ms*vs/ts);var stableMs=(ts>0&&vs>0)?Math.max(0,ms-ts):ms;var startup=(ts>0&&vs>0)?vs:0;return Math.max(0,Math.round(startup+stableMs*flow/60000));}"
                            "function faucetFlowCalibrationActiveStatus(s){return s==='waitingLocalRun'||s==='running';}"
                            "function faucetFlowCalibrationRefreshSamples(s,prev,valid,prevValid){if(s==='awaitingActual'||s==='readyToGenerate'||s==='generated'||valid!==prevValid)return faucetReplaceCalibrationSection('calibration-samples','/faucet/calibration/flow?partial=samples').catch(function(){});return Promise.resolve();}"
                            "function faucetStartCalibrationRefresh(){var e=document.getElementById('calibration-session');if(!e||!e.querySelector('[data-calibration-refresh]'))return;var prev=e.getAttribute('data-calibration-status')||'',prevValid=Number(e.getAttribute('data-calibration-valid-samples')||0);function poll(){if(document.hidden){setTimeout(poll,1000);return;}fetch('/api/faucet/status',{cache:'no-store',credentials:'same-origin'}).then(function(r){if(!r.ok)throw new Error('HTTP '+r.status);return r.json();}).then(function(s){var c=s.calibration||{},next=String(c.status||''),valid=Number(c.validSampleCount)||0;if(next!==prev||valid!==prevValid){return faucetReplaceCalibrationSection('calibration-session','/faucet/calibration/flow?partial=session').then(function(){return faucetFlowCalibrationRefreshSamples(next,prev,valid,prevValid);}).then(function(){prev=next;prevValid=valid;});}}).catch(function(){}).then(function(){if(faucetFlowCalibrationActiveStatus(prev))setTimeout(poll,1000);});}setTimeout(poll,1000);}"
                            "function faucetEstimateMeteringTrial(form){var ns=Number(form.dataset.startupPulses)||0,vs=Number(form.dataset.startupVolume)||0,ps=Number(form.dataset.stablePpl)||0,ts=Number(form.dataset.startupDurationMs)||0,flow=Number(form.dataset.stableFlowMlMin)||0,ml=Number((form.querySelector('[name=targetMl]')||{}).value)||0,sec=Number((form.querySelector('[name=targetSec]')||{}).value)||0,volumeDuration=faucetEstimateDurationForMl(ml,vs,ts,flow),volumePulses=faucetEstimatePulsesForMl(ml,ns,vs,ps),timeVolume=faucetEstimateVolumeForDuration(sec,vs,ts,flow),timePulses=faucetEstimatePulsesForMl(timeVolume,ns,vs,ps),vd=form.querySelector('[data-volume-estimated-duration]'),vp=form.querySelector('[data-volume-estimated-pulses]'),tv=form.querySelector('[data-time-estimated-volume]'),tp=form.querySelector('[data-time-estimated-pulses]');if(vd)vd.textContent=volumeDuration>0?faucetFormatEstimateSeconds(volumeDuration):'-';if(vp)vp.textContent=volumePulses>0?(volumePulses+'P'):'-';if(tv)tv.textContent=timeVolume>0?faucetFormatTrialLiters(timeVolume):'-';if(tp)tp.textContent=timePulses>0?(timePulses+'P'):'-';}"
                            "function faucetOpenMeteringTrial(btn){var modal=document.getElementById('metering-trial-modal');if(!modal)return;var form=modal.querySelector('.metering-trial-form');if(!form)return;form.dataset.startupPulses=btn.dataset.startupPulses||'0';form.dataset.startupVolume=btn.dataset.startupVolume||'0';form.dataset.stablePpl=btn.dataset.stablePpl||'0';form.dataset.startupDurationMs=btn.dataset.startupDurationMs||'0';form.dataset.stableFlowMlMin=btn.dataset.stableFlowMlMin||'0';var ml=form.querySelector('[name=targetMl]'),sec=form.querySelector('[name=targetSec]');if(ml)ml.value=btn.dataset.defaultMl||'1000';if(sec)sec.value=btn.dataset.defaultSec||'60';var label=form.querySelector('[data-trial-label]');if(label)label.textContent=(btn.dataset.trialLabel||'计量方案')+'：容量参数 '+form.dataset.startupPulses+'P / '+form.dataset.startupVolume+'ml / '+form.dataset.stablePpl+'P/L，时间参数 '+faucetFormatStartupSeconds(form.dataset.startupDurationMs)+' / '+form.dataset.stableFlowMlMin+'ml/min';modal.classList.add('is-open');modal.setAttribute('aria-hidden','false');faucetEstimateMeteringTrial(form);}"
                            "function faucetCloseMeteringTrial(){var modal=document.getElementById('metering-trial-modal');if(modal){modal.classList.remove('is-open');modal.setAttribute('aria-hidden','true');}}"
                            "function faucetSetSchemeDetail(modal,key,value){var e=modal.querySelector('[data-scheme-detail-field='+key+']');if(e)e.textContent=value||'-';}"
                            "function faucetOpenSchemeDetail(btn){var modal=document.getElementById('scheme-detail-modal');if(!modal)return;var d=btn.dataset;faucetSetSchemeDetail(modal,'id',d.detailId);faucetSetSchemeDetail(modal,'name',d.detailName);faucetSetSchemeDetail(modal,'status',d.detailStatus);faucetSetSchemeDetail(modal,'source',d.detailSource);faucetSetSchemeDetail(modal,'createdAt',d.detailCreatedAt);faucetSetSchemeDetail(modal,'startupPulses',d.detailStartupPulses);faucetSetSchemeDetail(modal,'startupVolume',d.detailStartupVolume);faucetSetSchemeDetail(modal,'stablePpl',d.detailStablePpl);faucetSetSchemeDetail(modal,'startupDuration',d.detailStartupDuration);faucetSetSchemeDetail(modal,'stableFlow',d.detailStableFlow);faucetSetSchemeDetail(modal,'sampleCount',d.detailSampleCount);faucetSetSchemeDetail(modal,'actualRange',d.detailActualRange);faucetSetSchemeDetail(modal,'maxError',d.detailMaxError);modal.classList.add('is-open');modal.setAttribute('aria-hidden','false');}"
                            "function faucetCloseSchemeDetail(){var modal=document.getElementById('scheme-detail-modal');if(modal){modal.classList.remove('is-open');modal.setAttribute('aria-hidden','true');}}"
                            "function faucetReplaceCalibrationSection(id,url){return fetch(url,{cache:'no-store',credentials:'same-origin'}).then(function(r){if(!r.ok)throw new Error('HTTP '+r.status);return r.text();}).then(function(html){var old=document.getElementById(id);if(!old)return;var box=document.createElement('div');box.innerHTML=html;var next=box.querySelector('#'+id);if(next)old.replaceWith(next);});}"
                            "function faucetRefreshFlowCalibrationCore(){return Promise.all([faucetReplaceCalibrationSection('calibration-session','/faucet/calibration/flow?partial=session'),faucetReplaceCalibrationSection('calibration-samples','/faucet/calibration/flow?partial=samples')]).then(function(){faucetStartCalibrationRefresh();});}"
                            "function faucetSubmitFlowCalibrationAction(f){if(typeof once==='function'&&!once(f))return false;var fd=new FormData(f);fd.set('ajax','1');fetch('/faucet/calibration/flow',{method:'POST',body:fd,cache:'no-store',credentials:'same-origin'}).then(function(r){if(!r.ok)return faucetReadCalibrationError(r).then(function(code){throw new Error(code);});return r.json();}).then(function(){return faucetRefreshFlowCalibrationCore().catch(function(){alert('操作已保存，但页面刷新失败，请手动刷新查看最新状态。');});}).catch(function(e){faucetResetSampleCalibrationForm(f);alert('操作失败：'+faucetCalibrationErrorMessage(e.message));});return false;}"
                            "faucetStartCalibrationRefresh();"
                            "</script>");
}

std::uint32_t sumRealRecordVolumeSince(std::uint32_t startTime) {
    if (!g_context.records || !g_context.records->ready() || startTime < kMinRealDateSeconds) {
        return 0;
    }
    std::uint32_t total = 0;
    WaterRecord* records = new (std::nothrow) WaterRecord[kMaxRecordPageSize]{};
    if (!records) {
        return 0;
    }
    const std::size_t count = g_context.records->count();
    for (std::size_t offset = 0; offset < count; offset += kMaxRecordPageSize) {
        const std::size_t page = offset / kMaxRecordPageSize;
        const std::size_t read = g_context.records->readPage(page, kMaxRecordPageSize, records, kMaxRecordPageSize);
        if (read == 0) {
            break;
        }
        for (std::size_t i = 0; i < read; ++i) {
            if (waterRecordHasRealTime(records[i]) && records[i].startTime >= startTime && records[i].volumeMl > 0) {
                addSaturating(total, records[i].volumeMl);
            }
        }
    }
    delete[] records;
    return total;
}

void sendDailyChart(const WaterUsageSummary& summary) {
    std::uint32_t maxVolume = 0;
    std::uint32_t maxCount = 0;
    for (std::size_t i = 0; i < summary.dayCount; ++i) {
        if (summary.days[i].volumeMl > maxVolume) {
            maxVolume = summary.days[i].volumeMl;
        }
        if (summary.days[i].count > maxCount) {
            maxCount = summary.days[i].count;
        }
    }
    const std::uint32_t chartMax = maxVolume == 0 ? 1000UL : maxVolume;
    const std::uint32_t countMax = maxCount == 0 ? 1UL : maxCount;
    Esp32BaseWeb::sendChunk("<section class='daily-chart'><div class='chart-head'><h3>最近 30 天出水量</h3>"
                            "<span class='chart-unit'>每日出水量 (L) · 每日次数</span></div>"
                            "<svg viewBox='0 0 1080 292' role='img' aria-label='最近30天每日出水量和每日次数'>");
    constexpr std::uint32_t top = 56;
    constexpr std::uint32_t baseY = 222;
    constexpr std::uint32_t chartHeight = baseY - top;
    constexpr std::uint32_t left = 90;
    constexpr std::uint32_t step = 31;
    constexpr std::uint32_t barWidth = 16;
    Esp32BaseWeb::sendChunk("<line class='axis' x1='72' y1='222' x2='1030' y2='222'></line>"
                            "<line class='axis' x1='72' y1='48' x2='72' y2='222'></line>"
                            "<line class='count-axis' x1='1030' y1='48' x2='1030' y2='222'></line>");
    for (std::uint32_t tick = 0; tick < 5; ++tick) {
        const std::uint32_t tickValue = (chartMax * tick) / 4UL;
        const std::uint32_t y = baseY - (chartHeight * tick) / 4UL;
        char tickText[24]{};
        formatLiters(tickValue, tickText, sizeof(tickText));
        sendFmt("<line class='grid' x1='72' y1='%lu' x2='1030' y2='%lu'></line>"
                "<text class='chart-y-tick' x='62' y='%lu'>%s</text>",
                static_cast<unsigned long>(y),
                static_cast<unsigned long>(y),
                static_cast<unsigned long>(y + 4UL),
                tickText);
    }
    std::uint32_t previousCountTick = countMax + 1UL;
    for (std::uint32_t tick = 0; tick < 4; ++tick) {
        const std::uint32_t countValue = (countMax * tick + 1UL) / 3UL;
        if (tick > 0 && countValue == previousCountTick) {
            continue;
        }
        previousCountTick = countValue;
        const std::uint32_t y = baseY - (chartHeight * countValue) / countMax;
        sendFmt("<text class='count-y-tick' x='1040' y='%lu'>%lu 次</text>",
                static_cast<unsigned long>(y + 4UL),
                static_cast<unsigned long>(countValue));
    }
    for (std::size_t i = 0; i < summary.dayCount; ++i) {
        const std::uint32_t x = left + static_cast<std::uint32_t>(i) * step;
        const DailyUsageBucket& day = summary.days[i];
        char label[8]{};
        char volume[24]{};
        char barLabel[12]{};
        char duration[24]{};
        formatDayLabel(day.dayIndex, label, sizeof(label));
        formatLiters(day.volumeMl, volume, sizeof(volume));
        formatChartLiters(day.volumeMl, barLabel, sizeof(barLabel));
        formatDurationShort(day.durationSec, duration, sizeof(duration));
        const std::uint32_t avgMl = day.count == 0 ? 0 : day.volumeMl / day.count;
        const std::uint32_t barHeight = day.volumeMl == 0 ? 0 : (day.volumeMl * chartHeight) / chartMax;
        const std::uint32_t y = baseY - barHeight;
        const std::uint32_t center = x + barWidth / 2UL;
        sendFmt("<rect class='%s' x='%lu' y='%lu' width='%lu' height='%lu' rx='1'><title>"
                "%s：%s · %u 次 · %s · 平均 %lu ml/次</title></rect>"
                "<text class='bar-label' x='%lu' y='%lu'>%s</text>"
                "<text class='x-label' x='%lu' y='250' transform='rotate(-45 %lu 250)'>%s</text>",
                day.count == 0 ? "bar empty-bar" : "bar",
                static_cast<unsigned long>(x),
                static_cast<unsigned long>(barHeight == 0 ? baseY - 3UL : y),
                static_cast<unsigned long>(barWidth),
                static_cast<unsigned long>(barHeight == 0 ? 3UL : barHeight),
                label,
                volume,
                static_cast<unsigned>(day.count),
                duration,
                static_cast<unsigned long>(avgMl),
                static_cast<unsigned long>(center),
                static_cast<unsigned long>(barHeight == 0 ? baseY - 10UL : (y > 10UL ? y - 8UL : y)),
                barLabel,
                static_cast<unsigned long>(center),
                static_cast<unsigned long>(center),
                label);
    }
    if (summary.dayCount > 0) {
        Esp32BaseWeb::sendChunk("<polyline class='count-line-halo' points='");
        for (std::size_t i = 0; i < summary.dayCount; ++i) {
            const DailyUsageBucket& day = summary.days[i];
            const std::uint32_t x = left + static_cast<std::uint32_t>(i) * step + barWidth / 2UL;
            const std::uint32_t y = baseY - (static_cast<std::uint32_t>(day.count) * chartHeight) / countMax;
            sendFmt("%s%lu,%lu",
                    i == 0 ? "" : " ",
                    static_cast<unsigned long>(x),
                    static_cast<unsigned long>(y));
        }
        Esp32BaseWeb::sendChunk("'></polyline><polyline class='count-line' points='");
        for (std::size_t i = 0; i < summary.dayCount; ++i) {
            const DailyUsageBucket& day = summary.days[i];
            const std::uint32_t x = left + static_cast<std::uint32_t>(i) * step + barWidth / 2UL;
            const std::uint32_t y = baseY - (static_cast<std::uint32_t>(day.count) * chartHeight) / countMax;
            sendFmt("%s%lu,%lu",
                    i == 0 ? "" : " ",
                    static_cast<unsigned long>(x),
                    static_cast<unsigned long>(y));
        }
        Esp32BaseWeb::sendChunk("'></polyline>");
        for (std::size_t i = 0; i < summary.dayCount; ++i) {
            const DailyUsageBucket& day = summary.days[i];
            if (day.count == 0) {
                continue;
            }
            const std::uint32_t center = left + static_cast<std::uint32_t>(i) * step + barWidth / 2UL;
            const std::uint32_t y = baseY - (static_cast<std::uint32_t>(day.count) * chartHeight) / countMax;
            const std::uint32_t barHeight = day.volumeMl == 0 ? 0 : (day.volumeMl * chartHeight) / chartMax;
            const std::uint32_t barTop = baseY - barHeight;
            const std::uint32_t barLabelY = barHeight == 0 ? baseY - 10UL : (barTop > 10UL ? barTop - 8UL : barTop);
            const std::uint32_t countLabelY = chooseCountLabelY(y, barLabelY);
            char countText[12]{};
            std::snprintf(countText, sizeof(countText), "%u次", static_cast<unsigned>(day.count));
            sendFmt("<circle class='count-dot' cx='%lu' cy='%lu' r='1.7'><title>%u 次</title></circle>"
                    "<text class='count-label' x='%lu' y='%lu'>%s</text>",
                    static_cast<unsigned long>(center),
                    static_cast<unsigned long>(y),
                    static_cast<unsigned>(day.count),
                    static_cast<unsigned long>(center),
                    static_cast<unsigned long>(countLabelY),
                    countText);
        }
    }
    Esp32BaseWeb::sendChunk("</svg></section>");
}

void sendTimeUnsyncedChartNotice() {
    Esp32BaseWeb::sendChunk("<section class='daily-chart'><h3>最近 30 天出水量</h3>"
                            "<p class='hint'>时间未同步，暂不生成按真实日期统计的图表；同步后会自动显示今日往前 30 天。</p>"
                            "</section>");
}

