tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
    sendCalibrationCenterFlowCard(snapshot);
    sendCalibrationCenterTemperatureCard(snapshot, *g_context.config);
    sendCalibrationCenterTdsCard(snapshot, *g_context.config);
    sendCalibrationPageScript();
    sendPageEnd();
}

void handleFlowCalibrationPage() {
    if (!Esp32BaseWeb::checkAuth()) {
        return;
    }
    if (!requireContext()) {
        return;
    }
    if (Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        handleFlowCalibrationPost();
        return;
    }
    char text[32]{};
    if (getParam("partial", text, sizeof(text))) {
        if (!Esp32BaseWeb::beginResponse(200, "text/html; charset=utf-8", nullptr)) {
            return;
        }
        if (std::strcmp(text, "schemes") == 0) {
            sendCalibrationParameterPanels();
        } else if (std::strcmp(text, "session") == 0) {
            sendFlowCalibrationSessionPanel(g_context.app->snapshot(), waterTaskActive());
        } else if (std::strcmp(text, "samples") == 0) {
            sendCalibrationSamplesPanel(configuredPulseObservationWindowSec());
        }
        Esp32BaseWeb::endResponse();
        return;
    }
    if (getParam("manual", text, sizeof(text))) {
        MeteringParameters prefill{};
        bool hasPrefill = false;
        if (!readMeteringManualPrefillFromQuery(prefill, hasPrefill)) {
            Esp32BaseWeb::redirectSeeOther("/faucet/calibration/flow?error=invalid_value");
            return;
        }
        MeteringSchemeRecord draft{};
        if (hasPrefill) {
            char name[kMeteringSchemeNameLength]{};
            const char* prefillName = getParam("name", name, sizeof(name)) && name[0] ? name : "手工参数";
            initializeManualMeteringScheme(draft, 0, prefillName, prefill, g_context.nowSeconds ? g_context.nowSeconds() : 0);
        }
        sendManualMeteringParameterPage(hasPrefill ? &draft : nullptr);
        return;
    }
    if (getParam("scheme", text, sizeof(text))) {
        if (std::strcmp(text, "new") == 0) {
            sendManualMeteringParameterPage(nullptr);
            return;
        }
        std::uint32_t id = 0;
        MeteringSchemeRecord scheme{};
        if (!parseU32(text, id) || !ensureMeteringSchemesReady() || !g_context.meteringSchemes->findById(id, scheme)) {
            Esp32BaseWeb::redirectSeeOther("/faucet/calibration/flow?error=invalid_value");
            return;
        }
        sendManualMeteringParameterPage(&scheme);
        return;
    }

    const AppSnapshot snapshot = g_context.app->snapshot();
    const bool taskActive = waterTaskActive();

    Esp32BaseWeb::sendHeader("流量计校准");
    Esp32BaseWeb::sendChunk("<h2>流量计校准</h2>");
    sendNoticeFromQuery();
    Esp32BaseWeb::sendChunk("<p class='muted'>本页负责录入实测容量、管理样本和应用参数；出水与停水只能在设备本地按键完成。</p>");
    sendFlowCalibrationSessionPanel(snapshot, taskActive);
    sendCalibrationSamplesPanel(configuredPulseObservationWindowSec());
    Esp32BaseWeb::sendChunk("<div class='calibration-param-layout'>");
    sendActiveMeteringSchemeSummaryPanel();
    Esp32BaseWeb::sendChunk("</div>");
    sendCalibrationParameterPanels();
    sendMeteringTrialModal();
    sendCalibrationPageScript();
    sendPageEnd();
}

void handleRecordDetailPage() {
    if (!Esp32BaseWeb::checkAuth()) {
        return;
    }
    if (Esp32BaseWeb::hasParam("info")) {
        handleRecordInfoPage();
        return;
    }
    char text[24]{};
    const bool fromCalibration = calibrationContextRequested();
    const char* backHref = fromCalibration ? "/faucet/calibration" : "/faucet/records";
    const char* backLabel = fromCalibration ? "返回校准" : "返回记录";
    const char* detailPath = fromCalibration ? "/faucet/calibration/detail" : "/faucet/records/detail";
    const char* contextParam = fromCalibration ? "from=calibration&" : "";
    if (!contextReady()) {
        Esp32BaseWeb::sendHeader("脉冲明细");
        Esp32BaseWeb::sendChunk("<h2>脉冲明细</h2><p class='err'>上下文未就绪。</p>");
        sendPageEnd();
        return;
    }
    if (!fromCalibration) {
        Esp32BaseWeb::sendHeader("记录详情");
        Esp32BaseWeb::sendChunk("<h2>记录详情</h2><p class='err'>普通出水记录不提供脉冲明细。</p><p><a class='btn-link' href='/faucet/records'>返回记录</a></p>");
        sendPageEnd();
        return;
    }
    if (waterTaskActive()) {
        sendBusyJson("record_detail");
        return;
    }
    bool useSessionTrace = false;
    std::uint32_t sessionTraceSlot = 0;
    std::uint32_t traceId = 0;
    if (fromCalibration && getParam("slot", text, sizeof(text))) {
        useSessionTrace = parseU32(text, sessionTraceSlot) && sessionTraceSlot < kCalibrationSessionTraceSlots;
    }
    if (!useSessionTrace && (!getParam("trace", text, sizeof(text)) || !parseU32(text, traceId))) {
        Esp32BaseWeb::sendHeader("脉冲明细");
        sendFmt("<h2>脉冲明细</h2><p class='err'>明细编号无效。</p><p><a class='btn-link' href='%s'>%s</a></p>",
                backHref,
                backLabel);
        sendPageEnd();
        return;
    }
    std::uint32_t bucketSeconds = 1;
    if (getParam("bucket", text, sizeof(text))) {
        parseU32(text, bucketSeconds);
    }
    if (bucketSeconds != 2 && bucketSeconds != 3 && bucketSeconds != 4 && bucketSeconds != 5) {
        bucketSeconds = 1;
    }
    const WaterPulseTrace* trace = nullptr;
    WaterPulseTrace sessionTrace{};
    std::unique_ptr<WaterPulseTraceBucketSample[]> compactBuckets;
    std::unique_ptr<WaterPulseTraceSample[]> startupEdges;
    std::size_t loadedBucketCount = 0;
    std::size_t loadedStartupEdgeCount = 0;
    if (useSessionTrace) {
        if (!g_context.calibrationSessionTraces || !g_context.calibrationSessionTraces->ready()) {
            Esp32BaseWeb::sendHeader("脉冲明细");
            sendFmt("<h2>脉冲明细</h2><p class='err'>校准会话脉冲数据不可用。</p><p><a class='btn-link' href='%s'>%s</a></p>",
                    backHref,
                    backLabel);
            sendPageEnd();
            return;
        }
        CalibrationStoredTrace stored{};
        if (!g_context.calibrationSessionTraces->load(static_cast<std::uint8_t>(sessionTraceSlot), stored)) {
            Esp32BaseWeb::sendHeader("脉冲明细");
            sendFmt("<h2>脉冲明细</h2><p class='err'>该校准会话脉冲明细不存在。</p><p><a class='btn-link' href='%s'>%s</a></p>",
                    backHref,
                    backLabel);
            sendPageEnd();
            return;
        }
        sessionTrace = stored.trace;
        trace = &sessionTrace;
        traceId = sessionTrace.traceId;
        compactBuckets.reset(new (std::nothrow) WaterPulseTraceBucketSample[trace->bucketCount]{});
        if (compactBuckets) {
            loadedBucketCount = g_context.calibrationSessionTraces->readBuckets(
                static_cast<std::uint8_t>(sessionTraceSlot), compactBuckets.get(), trace->bucketCount);
        }
        if (trace->startupEdgeCount > 0) {
            startupEdges.reset(new (std::nothrow) WaterPulseTraceSample[trace->startupEdgeCount]{});
            if (startupEdges) {
                loadedStartupEdgeCount = g_context.calibrationSessionTraces->readStartupEdges(
                    static_cast<std::uint8_t>(sessionTraceSlot), startupEdges.get(), trace->startupEdgeCount);
            }
        }
    } else {
        if (!g_context.pulseTraces) {
            Esp32BaseWeb::sendHeader("脉冲明细");
            sendFmt("<h2>脉冲明细</h2><p class='err'>脉冲明细缓存不可用。</p><p><a class='btn-link' href='%s'>%s</a></p>",
                    backHref,
                    backLabel);
            sendPageEnd();
            return;
        }
        trace = g_context.pulseTraces->findById(traceId);
        if (trace) {
            compactBuckets.reset(new (std::nothrow) WaterPulseTraceBucketSample[trace->bucketCount]{});
            if (compactBuckets) {
                for (std::size_t i = 0; i < trace->bucketCount; ++i) {
                    const WaterPulseTraceBucketSample* bucket = g_context.pulseTraces->bucketAt(*trace, i);
                    compactBuckets[i] = bucket ? *bucket : WaterPulseTraceBucketSample{};
                }
                loadedBucketCount = trace->bucketCount;
            }
            if (trace->startupEdgeCount > 0) {
                startupEdges.reset(new (std::nothrow) WaterPulseTraceSample[trace->startupEdgeCount]{});
                if (startupEdges) {
                    for (std::size_t i = 0; i < trace->startupEdgeCount; ++i) {
                        const WaterPulseTraceSample* edge = g_context.pulseTraces->startupEdgeAt(*trace, i);
                        startupEdges[i] = edge ? *edge : WaterPulseTraceSample{};
                    }
                    loadedStartupEdgeCount = trace->startupEdgeCount;
                }
            }
        }
    }
    if (!trace) {
        Esp32BaseWeb::sendHeader("脉冲明细");
        sendFmt("<h2>脉冲明细</h2><p class='err'>该脉冲明细不存在或已被 RAM 缓存淘汰。</p><p><a class='btn-link' href='%s'>%s</a></p>",
                backHref,
                backLabel);
        sendPageEnd();
        return;
    }
    if (!compactBuckets || loadedBucketCount != trace->bucketCount ||
        (trace->startupEdgeCount > 0 && (!startupEdges || loadedStartupEdgeCount != trace->startupEdgeCount))) {
        Esp32BaseWeb::sendHeader("脉冲明细");
        Esp32BaseWeb::sendChunk("<p class='err'>内存不足，无法生成脉冲明细。</p>");
        sendPageEnd();
        return;
    }
    WaterPulseTraceBucket* buckets = new (std::nothrow) WaterPulseTraceBucket[trace->bucketCount]{};
    if (!buckets) {
        Esp32BaseWeb::sendHeader("脉冲明细");
        Esp32BaseWeb::sendChunk("<p class='err'>内存不足，无法生成脉冲明细。</p>");
        sendPageEnd();
        return;
    }
    const std::size_t bucketCount = aggregateWaterPulseTrace(
        *trace, compactBuckets.get(), trace->bucketCount, bucketSeconds, buckets, trace->bucketCount);
    const WaterPulseTraceAnalysis analysis =
        analyzeWaterPulseTrace(*trace, compactBuckets.get(), trace->bucketCount, pulseAnalysisOptionsForWeb());
    std::uint32_t maxDelta = 1;
    for (std::size_t i = 0; i < bucketCount; ++i) {
        maxDelta = std::max(maxDelta, buckets[i].pulseDelta);
    }
    const std::uint32_t effectivePulseCountValue = trace->totalPulses;
    std::uint32_t pauseTotalUs = 0;
    for (std::uint8_t i = 0; i < trace->pauseWindowCount; ++i) {
        const WaterPulseTracePauseWindow& window = trace->pauseWindows[i];
        if (window.endElapsedUs > window.startElapsedUs) {
            pauseTotalUs += window.endElapsedUs - window.startElapsedUs;
        }
    }
    MeteringParameters trendMeteringParams{};
    const bool trendVolumeReady = meteringParamsForRecordTrend(trace->record, trendMeteringParams);
    const std::uint32_t estimatedFinalVolumeMl =
        trendVolumeReady ? estimateVolumeMlFromPulses(effectivePulseCountValue, trendMeteringParams) : 0;
    const std::uint32_t maxVolumeMl =
        trendVolumeReady ? std::max<std::uint32_t>(1, std::max(trace->record.volumeMl, estimatedFinalVolumeMl)) : 1;

    char startTime[40]{};
    formatWaterRecordTime(trace->record, startTime, sizeof(startTime));
    const std::size_t traceBytes = sizeof(WaterPulseTrace) +
                                   trace->bucketCount * sizeof(WaterPulseTraceBucketSample) +
                                   trace->startupEdgeCount * sizeof(WaterPulseTraceSample);
    char traceKb[24]{};
    formatKb(traceBytes, traceKb, sizeof(traceKb));
    char detailSourceParam[32]{};
    if (useSessionTrace) {
        std::snprintf(detailSourceParam,
                      sizeof(detailSourceParam),
                      "slot=%u",
                      static_cast<unsigned>(sessionTraceSlot));
    } else {
        std::snprintf(detailSourceParam,
                      sizeof(detailSourceParam),
                      "trace=%lu",
                      static_cast<unsigned long>(traceId));
    }
    const std::uint32_t traceActualMl = actualMlForTrace(*trace);
    const bool traceActualSynced = trace->actualMl > 0;
    const bool traceActualFromRecord = !traceActualSynced && traceActualMl > 0;
    const std::uint32_t detailVolumeMl = traceActualMl > 0 ? traceActualMl : trace->record.volumeMl;
    char averageFlowText[24]{};
    formatFlowLitersPerMin(recordFlowMlPerMin(detailVolumeMl, trace->record.durationSec),
                           averageFlowText,
                           sizeof(averageFlowText));
    Esp32BaseWeb::sendHeader("脉冲明细");
    sendFmt("<h2>脉冲明细</h2><div class='form-actions'><a class='btn-link' href='%s'>%s</a>",
            backHref,
            backLabel);
    Esp32BaseWeb::sendChunk("</div>");
    if (trace->bucketCount > 0) {
        sendFmt("<p class='hint'>该明细使用 500ms 时间桶保存全程有效脉冲趋势，并保留前 %lu 秒启动边沿。</p>",
                static_cast<unsigned long>(kPulseTraceStartupDetailMs / 1000UL));
    }

