tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
    Esp32BaseWeb::sendChunk("<section class='panel sample-status-panel'><h3>样本状态</h3><table class='kv'>");
    if (traceActualSynced) {
        Esp32BaseWeb::sendChunk("<tr><th>状态</th><td><span class='status-pill status-ok'>样本已入库</span></td></tr>");
    } else if (traceActualFromRecord) {
        Esp32BaseWeb::sendChunk("<tr><th>状态</th><td><span class='status-pill status-ok'>容量已校准</span></td></tr>");
    } else {
        Esp32BaseWeb::sendChunk("<tr><th>状态</th><td><span class='status-pill status-muted'>待校准容量</span></td></tr>"
                                "<tr><th>下一步</th><td>请在校准页的样本列表中校准这条记录的量杯实测容量。</td></tr>");
    }
    if (traceActualMl > 0) {
        Esp32BaseWeb::sendChunk("<tr><th>实测容量</th><td>");
        sendLitersMl(traceActualMl);
        Esp32BaseWeb::sendChunk("</td></tr>");
        Esp32BaseWeb::sendChunk(traceActualFromRecord
                                    ? "<tr><th>来源</th><td>来自校准容量记录。</td></tr>"
                                    : "<tr><th>来源</th><td>来自 RAM 明细。</td></tr>");
    }
    if (trace->resumedAfterPause) {
        Esp32BaseWeb::sendChunk("<tr><th>可用性</th><td>暂停后恢复出水，属于多段出水，不参与启动段和分段校准拟合。</td></tr>");
    } else if ((trace->flags & kPulseTraceFlagBucketOverflow) != 0) {
        Esp32BaseWeb::sendChunk("<tr><th>可用性</th><td>时间桶已达到记录上限，不入库，不参与生成校准参数。</td></tr>");
    } else if (traceActualMl > 0 && analysis.stable) {
        sendFmt("<tr><th>可用性</th><td>已记录实测容量，稳态从第 %lu 秒开始；参数生成使用校准会话保存的样本摘要。</td></tr>",
                static_cast<unsigned long>(analysis.stableStartSec));
    } else if (analysis.stable) {
        sendFmt("<tr><th>可用性</th><td>脉冲稳定，输入实测容量后可作为明细参考；稳态从第 %lu 秒开始。</td></tr>",
                static_cast<unsigned long>(analysis.stableStartSec));
    } else if (traceActualMl > 0) {
        Esp32BaseWeb::sendChunk("<tr><th>可用性</th><td>实测容量已记录，但稳态识别失败。</td></tr>");
    } else {
        Esp32BaseWeb::sendChunk("<tr><th>可用性</th><td>缺少实测容量且稳态识别失败。</td></tr>");
    }
    Esp32BaseWeb::sendChunk("</table><p class='hint'>脉冲明细用于查看图表和复核；参数生成使用每次校准保存时提取的摘要，不重复扫描启动边沿。</p></section>");

    Esp32BaseWeb::sendChunk("<section class='panel'><h3>明细概况</h3><table class='kv'>");
    sendFmt("<tr><th>开始时间</th><td>%s</td></tr>"
            "<tr><th>目标</th><td>",
            startTime);
    sendTargetValue(trace->record);
    Esp32BaseWeb::sendChunk("</td></tr><tr><th>固件估算</th><td>");
    sendLiters(trace->record.volumeMl);
    Esp32BaseWeb::sendChunk("</td></tr>");
    sendFmt("<tr><th>平均流速</th><td>%s</td></tr>", averageFlowText);
    if (trendVolumeReady) {
        char maxFlowText[24]{};
        char stableFlowText[24]{};
        formatFlowLitersPerMin(bucketFlowMlPerMin(maxDelta, bucketSeconds, trendMeteringParams),
                               maxFlowText,
                               sizeof(maxFlowText));
        formatFlowLitersPerMin(stableFlowMlPerMin(analysis.stablePulsePerSec, trendMeteringParams),
                               stableFlowText,
                               sizeof(stableFlowText));
        sendFmt("<tr><th>启动脉冲数</th><td>%lu P</td></tr>"
                "<tr><th>启动水量</th><td>%lu ml</td></tr>"
                "<tr><th>稳态 P/L</th><td>%lu P/L</td></tr>"
                "<tr><th>最高流速</th><td>%s</td></tr>",
                static_cast<unsigned long>(trendMeteringParams.startupPulseCount),
                static_cast<unsigned long>(trendMeteringParams.startupVolumeMl),
                static_cast<unsigned long>(trendMeteringParams.stablePulsePerLiter),
                maxFlowText);
        if (analysis.stable) {
            sendFmt("<tr><th>稳态流速</th><td>%s</td></tr>", stableFlowText);
        }
        if (trace->record.mode == WaterMode::Volume) {
            const MeteringTargetEstimate targetEstimate =
                meteringEstimateForTarget(trendMeteringParams, trace->record.targetValue);
            if (targetEstimate.valid) {
                sendFmt("<tr><th>目标预计总脉冲</th><td>%lu P</td></tr>"
                        "<tr><th>目标全程平均 P/L</th><td>%lu P/L</td></tr>",
                        static_cast<unsigned long>(targetEstimate.pulseCount),
                        static_cast<unsigned long>(targetEstimate.fullRunPulsePerLiter));
            }
        }
    }
    sendFmt("<tr><th>有效脉冲</th><td>%lu</td></tr>"
            "<tr><th>最小间隔过滤</th><td>%lu</td></tr>"
            "<tr><th>时间桶</th><td>%lu 个，每桶 %lu ms</td></tr>"
            "<tr><th>启动边沿</th><td>%lu 个</td></tr>"
            "<tr><th>最高频率</th><td>%lu 脉冲/%lus</td></tr>"
            "<tr><th>暂停次数</th><td>%u</td></tr>"
            "<tr><th>暂停总时长</th><td>",
            static_cast<unsigned long>(effectivePulseCountValue),
            static_cast<unsigned long>(trace->minIntervalFilteredCount),
            static_cast<unsigned long>(trace->bucketCount),
            static_cast<unsigned long>(kPulseTraceBucketMs),
            static_cast<unsigned long>(trace->startupEdgeCount),
            static_cast<unsigned long>(maxDelta),
            static_cast<unsigned long>(bucketSeconds),
            static_cast<unsigned>(trace->pauseWindowCount));
    sendDurationSeconds(pauseTotalUs);
    sendFmt("</td></tr><tr><th>暂停后恢复</th><td>%s</td></tr>"
            "<tr><th>持续时间</th><td>%lu s</td></tr>"
            "<tr><th>样本数</th><td>%lu</td></tr>"
            "<tr><th>本条占用</th><td>%s</td></tr>",
            trace->resumedAfterPause ? "是" : "否",
            static_cast<unsigned long>(trace->record.durationSec),
            static_cast<unsigned long>(trace->bucketCount + trace->startupEdgeCount),
            traceKb);
    if (analysis.stable) {
        sendFmt("<tr><th>稳态开始</th><td>第 %lu 秒，启动段 %lu 脉冲，稳态 %.2f P/s，置信度 %u%%</td></tr>",
                static_cast<unsigned long>(analysis.stableStartSec),
                static_cast<unsigned long>(analysis.startupPulseCount),
                static_cast<double>(analysis.stablePulsePerSec),
                static_cast<unsigned>(analysis.confidence));
    } else {
        Esp32BaseWeb::sendChunk("<tr><th>稳态识别</th><td>无法识别</td></tr>");
    }
    Esp32BaseWeb::sendChunk("</table></section>");

    Esp32BaseWeb::sendChunk("<section id='pulse-trend' class='panel'><div class='panel-head'><h3>脉冲趋势</h3><div class='row-actions trace-frequency'><span class='trace-frequency-label'>聚合频率</span>");
    constexpr std::uint32_t bucketsToShow[] = {1, 2, 3, 4, 5};
    for (std::uint32_t bucket : bucketsToShow) {
        const char* linkClass = bucket == bucketSeconds ? "btn-link page-current" : "btn-link";
        sendFmt("<a class='%s' aria-current='%s' href='%s?%s%s&bucket=%lu' onclick='return faucetLoadTraceChart(this)'>%lus</a>",
                linkClass,
                bucket == bucketSeconds ? "true" : "false",
                detailPath,
                contextParam,
                detailSourceParam,
                static_cast<unsigned long>(bucket),
                static_cast<unsigned long>(bucket));
    }
    const std::uint32_t left = 54;
    const std::uint32_t top = 28;
    const std::uint32_t baseY = 224;
    const std::uint32_t chartHeight = 176;
    const std::uint32_t chartWidth = 900;
    const std::uint32_t maxEndSec =
        bucketCount == 0 ? 1 : std::max<std::uint32_t>(1, buckets[bucketCount - 1].startSec + buckets[bucketCount - 1].durationSec);
    const std::uint64_t maxChartUs = static_cast<std::uint64_t>(maxEndSec) * 1000000ULL;
    auto chartXForElapsedUs = [&](std::uint32_t elapsedUs) -> std::uint32_t {
        const std::uint64_t clamped = std::min<std::uint64_t>(elapsedUs, maxChartUs);
        return left + static_cast<std::uint32_t>((clamped * chartWidth) / std::max<std::uint64_t>(1, maxChartUs));
    };
    Esp32BaseWeb::sendChunk("</div></div><div class='pulse-detail-chart'><svg viewBox='0 0 1000 300' role='img' aria-label='脉冲明细折线图'>"
                            "<line class='axis' x1='54' y1='224' x2='954' y2='224'></line>"
                            "<line class='axis' x1='54' y1='28' x2='54' y2='224'></line>"
                            "<line class='axis' x1='954' y1='28' x2='954' y2='224'></line>");
    for (std::uint8_t i = 0; i < trace->pauseWindowCount; ++i) {
        const WaterPulseTracePauseWindow& window = trace->pauseWindows[i];
        const std::uint32_t endUs =
            window.endElapsedUs > window.startElapsedUs ? window.endElapsedUs : static_cast<std::uint32_t>(std::min<std::uint64_t>(maxChartUs, UINT32_MAX));
        const std::uint32_t x1 = chartXForElapsedUs(window.startElapsedUs);
        std::uint32_t x2 = chartXForElapsedUs(endUs);
        if (x2 <= x1) {
            x2 = x1 + 1U;
        }
        sendFmt("<rect class='pause-window' x='%lu' y='%lu' width='%lu' height='%lu'><title>暂停区间 %lu.%03lu s - %lu.%03lu s</title></rect>"
                "<line class='pause-boundary' x1='%lu' y1='%lu' x2='%lu' y2='%lu'></line>"
                "<line class='pause-boundary' x1='%lu' y1='%lu' x2='%lu' y2='%lu'></line>",
                static_cast<unsigned long>(x1),
                static_cast<unsigned long>(top),
                static_cast<unsigned long>(x2 - x1),
                static_cast<unsigned long>(baseY - top),
                static_cast<unsigned long>(window.startElapsedUs / 1000000UL),
                static_cast<unsigned long>((window.startElapsedUs % 1000000UL) / 1000UL),
                static_cast<unsigned long>(endUs / 1000000UL),
                static_cast<unsigned long>((endUs % 1000000UL) / 1000UL),
                static_cast<unsigned long>(x1),
                static_cast<unsigned long>(top),
                static_cast<unsigned long>(x1),
                static_cast<unsigned long>(baseY),
                static_cast<unsigned long>(x2),
                static_cast<unsigned long>(top),
                static_cast<unsigned long>(x2),
                static_cast<unsigned long>(baseY));
    }
    for (std::uint32_t i = 1; i <= 4; ++i) {
        const std::uint32_t y = baseY - (chartHeight * i) / 4;
        sendFmt("<line class='grid-line' x1='54' y1='%lu' x2='954' y2='%lu'></line>",
                static_cast<unsigned long>(y),
                static_cast<unsigned long>(y));
    }
    for (std::uint32_t i = 0; i <= 4; ++i) {
        const std::uint32_t y = baseY - (chartHeight * i) / 4;
        const std::uint32_t value = (maxDelta * i + 2U) / 4U;
        sendFmt("<text class='chart-label chart-y-label' x='48' y='%lu'>%lu</text>",
                static_cast<unsigned long>(y + 4U),
                static_cast<unsigned long>(value));
    }
    const std::uint32_t xLabelCount =
        maxEndSec <= 12 ? std::min<std::uint32_t>(maxEndSec + 1U, 13U) : 11U;
    for (std::uint32_t i = 0; i < xLabelCount; ++i) {
        const std::uint32_t denom = std::max<std::uint32_t>(1U, xLabelCount - 1U);
        const std::uint32_t x = left + (chartWidth * i) / denom;
        const std::uint32_t value = (maxEndSec * i + denom / 2U) / denom;
        sendFmt("<text class='chart-label chart-x-label' x='%lu' y='248'>%lus</text>",
                static_cast<unsigned long>(x),
                static_cast<unsigned long>(value));
    }
    sendFmt("<text class='chart-label' x='58' y='20'>最高 %lu 脉冲/%lus</text>",
            static_cast<unsigned long>(maxDelta),
            static_cast<unsigned long>(bucketSeconds));
    bool prevPulseValid = false;
    std::uint32_t prevPulseX = left;
    std::uint32_t prevPulseY = baseY;
    for (std::size_t i = 0; i < bucketCount; ++i) {
        const std::uint32_t chartDelta = bucketRunningPulseDelta(buckets[i]);
        const std::uint32_t startSec = buckets[i].startSec;
        const std::uint32_t endSec = buckets[i].startSec + buckets[i].durationSec;
        const std::uint32_t startX = left + (startSec * chartWidth) / maxEndSec;
        const std::uint32_t x = left + (endSec * chartWidth) / maxEndSec;
        const std::uint32_t y = baseY - (chartDelta * chartHeight) / maxDelta;
        const std::uint32_t lineStartX = prevPulseValid ? prevPulseX : startX;
        const std::uint32_t lineStartY = prevPulseValid ? prevPulseY : baseY;
        sendFmt("<line class='pulse-line' x1='%lu' y1='%lu' x2='%lu' y2='%lu'></line>",
                static_cast<unsigned long>(lineStartX),
                static_cast<unsigned long>(lineStartY),
                static_cast<unsigned long>(x),
                static_cast<unsigned long>(y));
        prevPulseValid = true;
        prevPulseX = x;
        prevPulseY = y;
    }
    if (trendVolumeReady) {
        bool prevVolumeValid = false;
        std::uint32_t prevVolumeX = left;
        std::uint32_t prevVolumeY = baseY;
        std::uint32_t volumeCumulativePulses = 0;
        for (std::size_t i = 0; i < bucketCount; ++i) {
            const std::uint32_t chartDelta = bucketRunningPulseDelta(buckets[i]);
            volumeCumulativePulses += chartDelta;
            const std::uint32_t volumeMl = estimateVolumeMlFromPulses(volumeCumulativePulses, trendMeteringParams);
            char volumeText[24]{};
            formatLitersMl(volumeMl, volumeText, sizeof(volumeText));
            const std::uint32_t startSec = buckets[i].startSec;
            const std::uint32_t endSec = buckets[i].startSec + buckets[i].durationSec;
            const std::uint32_t startX = left + (startSec * chartWidth) / maxEndSec;
            const std::uint32_t x = left + (endSec * chartWidth) / maxEndSec;
            const std::uint32_t y =
                baseY - static_cast<std::uint32_t>((static_cast<std::uint64_t>(volumeMl) * chartHeight) / maxVolumeMl);
            const std::uint32_t lineStartX = prevVolumeValid ? prevVolumeX : startX;
            const std::uint32_t lineStartY = prevVolumeValid ? prevVolumeY : baseY;
            const char* volumeLineClass =
                buckets[i].state == WaterPulseTraceState::Paused ? "volume-line volume-line-paused" : "volume-line";
            sendFmt("<line class='%s' x1='%lu' y1='%lu' x2='%lu' y2='%lu'><title>第%lu秒: 累计估算出水量 %s / 有效累计 %luP</title></line>",
                    volumeLineClass,
                    static_cast<unsigned long>(lineStartX),
                    static_cast<unsigned long>(lineStartY),
                    static_cast<unsigned long>(x),
                    static_cast<unsigned long>(y),
                    static_cast<unsigned long>(buckets[i].startSec),
                    volumeText,
                    static_cast<unsigned long>(volumeCumulativePulses));
            prevVolumeValid = true;
            prevVolumeX = x;
            prevVolumeY = y;
        }
    }
    if (analysis.stable) {
        const std::uint32_t stableX = left + (analysis.stableStartSec * chartWidth) / maxEndSec;
        sendFmt("<line class='stable-line' x1='%lu' y1='%lu' x2='%lu' y2='%lu'></line>"
                "<text class='chart-label' x='%lu' y='42'>稳态 %lus</text>",
                static_cast<unsigned long>(stableX),
                static_cast<unsigned long>(top),
                static_cast<unsigned long>(stableX),
                static_cast<unsigned long>(baseY),
                static_cast<unsigned long>(stableX + 6),
                static_cast<unsigned long>(analysis.stableStartSec));
    }
    std::uint32_t effectiveCumulative = 0;
    for (std::size_t i = 0; i < bucketCount; ++i) {
        const std::uint32_t chartDelta = bucketRunningPulseDelta(buckets[i]);
        effectiveCumulative += chartDelta;
        const std::uint32_t endSec = buckets[i].startSec + buckets[i].durationSec;
        const std::uint32_t x = left + (endSec * chartWidth) / maxEndSec;
        const std::uint32_t y = baseY - (chartDelta * chartHeight) / maxDelta;
        sendFmt("<circle class='pulse-dot' cx='%lu' cy='%lu' r='2.8'><title>第%lu秒: 有效脉冲 %lu / 有效累计 %lu / %s</title></circle>",
                static_cast<unsigned long>(x),
                static_cast<unsigned long>(y),
                static_cast<unsigned long>(buckets[i].startSec),
                static_cast<unsigned long>(chartDelta),
                static_cast<unsigned long>(effectiveCumulative),
                traceStateText(buckets[i].state));
    }
    Esp32BaseWeb::sendChunk("</svg></div><div class='chart-legend'>"
                            "<span><i class='legend-mark legend-pulse'></i>有效脉冲</span>");
    if (trendVolumeReady) {
        Esp32BaseWeb::sendChunk("<span><i class='legend-mark legend-volume'></i>累计估算出水量</span>");
    }
    Esp32BaseWeb::sendChunk("<span><i class='legend-mark legend-paused'></i>暂停区间</span>"
                            "<span><i class='legend-mark legend-stable'></i>稳态开始</span>"
                            "</div></section>");
    Esp32BaseWeb::sendChunk("<section class='panel detail-data'><div class='panel-head'><h3>时间桶明细</h3></div>");
    sendFmt("<p class='hint'>全程按 %lu ms 时间桶保存有效脉冲，共 %lu 个桶，最小间隔过滤 %lu 次。</p>"
            "<table class='trace-detail-table'><tr><th>时间</th><th>脉冲</th><th>累计</th><th>状态</th></tr>",
            static_cast<unsigned long>(kPulseTraceBucketMs),
            static_cast<unsigned long>(trace->bucketCount),
            static_cast<unsigned long>(trace->minIntervalFilteredCount));
    std::uint32_t bucketCumulative = 0;
    for (std::size_t i = 0; i < trace->bucketCount; ++i) {
        const std::uint32_t startMs = static_cast<std::uint32_t>(i * kPulseTraceBucketMs);
        const std::uint32_t endMs = startMs + kPulseTraceBucketMs;
        bucketCumulative += compactBuckets[i].pulseCount;
        sendFmt("<tr><td>%lu.%03lu-%lu.%03lu s</td><td>%u</td><td>%lu</td><td>%s</td></tr>",
                static_cast<unsigned long>(startMs / 1000UL),
                static_cast<unsigned long>(startMs % 1000UL),
                static_cast<unsigned long>(endMs / 1000UL),
                static_cast<unsigned long>(endMs % 1000UL),
                static_cast<unsigned>(compactBuckets[i].pulseCount),
                static_cast<unsigned long>(bucketCumulative),
                i >= loadedBucketCount ? "未保存" : "已保存");
    }
    Esp32BaseWeb::sendChunk("</table></section>");

